Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/lib/include/rtl8735b_sdiohost_type.h
#ifndef _RTL8735B_SDIOHOST_TYPE_H_
#define _RTL8735B_SDIOHOST_TYPE_H_

/**************************************************************************//**
 * @defgroup SDIOHOST_SRAM_CTL
 * @brief  SRAM Configuration Register               (@ 0XA00)
 * @{
 *****************************************************************************/
#define SDIOHOST_SHIFT_BUF_READ_SIZE                 24
#define SDIOHOST_MASK_BUF_READ_SIZE                  ((u32)0x00000003 << 24)                             /*!<R/W 0x2  Buffer Data Port Read Size (BDPRS) 2'b00: 1-byte access, port_a_rd_ptr increments by 1 2'b01: 2-byte access, port_a_rd_ptr increments by 2 2'b10: 4-byte access, port_a_rd_ptr increments by 4 2'b11: Decoding byte enable (BE[3:0]) bus signal If block-size is odd-byte, please set buf_read_size = 2'b00. */
#define SDIOHOST_SHIFT_AHBM_HPROT_CFG                20
#define SDIOHOST_MASK_AHBM_HPROT_CFG                 ((u32)0x0000000F << 20)                             /*!<R/W 0x1  AHB Bus Protection Control */
#define SDIOHOST_SHIFT_AHBM_HBURST_CFG               16
#define SDIOHOST_MASK_AHBM_HBURST_CFG                ((u32)0x0000000F << 16)                             /*!<R/W 0xF  2'b0001: ena_inc4: INCR4 Burst Type Enable 2'b0010: ena_inc8: INCR8 Burst Type Enable 2'b0100: ena_inc16: INCR16 Burst Type Enable 2'b1000: ena_incrx_align: Alignment Burst Type Enable */
#define SDIOHOST_SHIFT_LX_SWAP                       10
#define SDIOHOST_BIT_LX_SWAP                         ((u32)0x00000001 << 10)                             /*!<R/W 0  RSVD */
#define SDIOHOST_SHIFT_LX_BURST_SIZE                 8
#define SDIOHOST_MASK_LX_BURST_SIZE                  ((u32)0x00000003 << 8)                              /*!<R/W 0x2  2'b00: Burst length = 64 bytes (16 DWORD) 2'b01: Burst length = 128 bytes (32 DWORD) 2'b10: Burst length = 256 bytes (64 DWORD) 2'b11: Reserved */
#define SDIOHOST_SHIFT_MCU_BUF_ACCESS                1
#define SDIOHOST_MASK_MCU_BUF_ACCESS                 ((u32)0x00000003 << 1)                              /*!<R/W 0  in bit[0] = 1 condition, bit[2:1] = 'b00: buf access disable. bit[2:1] = 'b01: buff abs access enable, ring buffer address is direct mapping to 0x4005_CB00 ~ 0x4005_CEFF. (mcu_addr[15:0] = 0x0 ~ 0x3FF, mcu_cs_buf_absolute) 0x4005_CB30 (sram data [7:0]), 0x4005_CB31 (sram data [15:8]), 0x4005_CB32 (sram data [23:16]), 0x4005_CB33 (sram data [31:24]), address will auto increase by 4. bit[2:1] = 'b10: buf auto access enable, ring buffer could be accessed by register (mcu_addr = F30 ~ FE33 mcu_cs_buf_auto) bit[2:1] = 'b11: buf access disable. */
#define SDIOHOST_SHIFT_MCU_SEL                       0
#define SDIOHOST_BIT_MCU_SEL                         ((u32)0x00000001 << 0)                              /*!<R 0  These bits select the type of interface for the SDIO Host. 0: elbi interface (DWORD access for SDIO Host standard register) 1: mcu interface (byte access for SDIO IP register) */
/** @} */

/**************************************************************************//**
 * @defgroup SDIOHOST_IP_CTL
 * @brief  SDIO IP Control Register                  (@ 0XA10)
 * @{
 *****************************************************************************/
#define SDIOHOST_SHIFT_IP_ENDIAN_SEL                 4
#define SDIOHOST_BIT_IP_ENDIAN_SEL                   ((u32)0x00000001 << 4)                              /*!<R/W 0  0:Little; 1:Big */
#define SDIOHOST_SHIFT_L4_GATED_DISABLE_IP           3
#define SDIOHOST_BIT_L4_GATED_DISABLE_IP             ((u32)0x00000001 << 3)                              /*!<R/W 0  Disable L4 clock gated for ip */
#define SDIOHOST_SHIFT_DBUS_ENDIAN_SEL               2
#define SDIOHOST_BIT_DBUS_ENDIAN_SEL                 ((u32)0x00000001 << 2)                              /*!<R/W 0  0: Little; 1: Big */
#define SDIOHOST_SHIFT_L4_GATED_DISABLE              1
#define SDIOHOST_BIT_L4_GATED_DISABLE                ((u32)0x00000001 << 1)                              /*!<R/W 0  Disable L4 clock gated */
#define SDIOHOST_SHIFT_SUSPEND_N                     0
#define SDIOHOST_BIT_SUSPEND_N                       ((u32)0x00000001 << 0)                              /*!<R/W 0x1  suspend, low active */
/** @} */

/**************************************************************************//**
 * @defgroup SDIOHOST_DBG1
 * @brief  Debug 1                                   (@ 0XA20)
 * @{
 *****************************************************************************/
#define SDIOHOST_SHIFT_WRITE_ENABLE3                 9
#define SDIOHOST_BIT_WRITE_ENABLE3                   ((u32)0x00000001 << 9)                              /*!<W 0  Write enable for bit[8..6] */
#define SDIOHOST_SHIFT_SEL1                          6
#define SDIOHOST_MASK_SEL1                           ((u32)0x00000007 << 6)                              /*!<R/W 0  Select control of dbg_sel1.  */
#define SDIOHOST_SHIFT_WRITE_ENABLE2                 5
#define SDIOHOST_BIT_WRITE_ENABLE2                   ((u32)0x00000001 << 5)                              /*!<W 0  Write enable for bit[4..2] */
#define SDIOHOST_SHIFT_SEL0                          2
#define SDIOHOST_MASK_SEL0                           ((u32)0x00000007 << 2)                              /*!<R/W 0  Select control of dbg_sel0. */
#define SDIOHOST_SHIFT_WRITE_ENABLE1                 1
#define SDIOHOST_BIT_WRITE_ENABLE1                   ((u32)0x00000001 << 1)                              /*!<W 0  Write enable for bit0. */
#define SDIOHOST_SHIFT_ENABLE                        0
#define SDIOHOST_BIT_ENABLE                          ((u32)0x00000001 << 0)                              /*!<R/W 0  Debug Enable. */
/** @} */

/**************************************************************************//**
 * @defgroup SDIOHOST_DBG2
 * @brief  Debug 2                                   (@ 0XA24)
 * @{
 *****************************************************************************/
#define SDIOHOST_SHIFT_DBUS_DBG_SEL                  0
#define SDIOHOST_MASK_DBUS_DBG_SEL                   ((u32)0x00000007 << 0)                              /*!<R/W 0  sdio dbus dbg select */
/** @} */

/**************************************************************************//**
 * @defgroup SDIOHOST_DBG3
 * @brief  Debug 3                                   (@ 0XA28)
 * @{
 *****************************************************************************/
#define SDIOHOST_SHIFT_IP_DBG_SEL                    0
#define SDIOHOST_MASK_IP_DBG_SEL                     ((u32)0x000000FF << 0)                              /*!<R/W 0  sdio ip dbg select */
/** @} */

/**************************************************************************//**
 * @defgroup SDIOHOST_ISR
 * @brief  Interrupt Service Routine                 (@ 0XA30)
 * @{
 *****************************************************************************/
#define SDIOHOST_SHIFT_INT4                          4
#define SDIOHOST_BIT_INT4                            ((u32)0x00000001 << 4)                              /*!<R/W 0  SDIO Int4. SDIO IP Int. */
#define SDIOHOST_SHIFT_INT3                          3
#define SDIOHOST_BIT_INT3                            ((u32)0x00000001 << 3)                              /*!<R/W 0  SD Int3.SB1 wlast/rlast. */
#define SDIOHOST_SHIFT_RSVD1                         2
#define SDIOHOST_BIT_RSVD1                           ((u32)0x00000001 << 2)                              /*!<- 0  RSVD */
#define SDIOHOST_SHIFT_INT1                          1
#define SDIOHOST_BIT_INT1                            ((u32)0x00000001 << 1)                              /*!<R/W 0  SDIO Int1. DMA done. */
#define SDIOHOST_SHIFT_WRITE_DATA                    0
#define SDIOHOST_BIT_WRITE_DATA                      ((u32)0x00000001 << 0)                              /*!<W 0  1 to set, 0 to clear bit with 1. */
/** @} */

/**************************************************************************//**
 * @defgroup SDIOHOST_ISREN
 * @brief  Interrupt Service Routine Enable          (@ 0XA34)
 * @{
 *****************************************************************************/
#define SDIOHOST_SHIFT_INT4_EN                       4
#define SDIOHOST_BIT_INT4_EN                         ((u32)0x00000001 << 4)                              /*!<R/W 0  SDIO Int4 Enable, IP Int Enable */
#define SDIOHOST_SHIFT_INT3_EN                       3
#define SDIOHOST_BIT_INT3_EN                         ((u32)0x00000001 << 3)                              /*!<R/W 0  SDIO Int3 Enable, SB1 wlast/rlast Int Enable */
#define SDIOHOST_SHIFT_INT1_EN                       1
#define SDIOHOST_BIT_INT1_EN                         ((u32)0x00000001 << 1)                              /*!<R/W 0  SDIO Int1 Enable, Dma done Int Enable */
#define SDIOHOST_SHIFT_WRITE_DATA                    0
#define SDIOHOST_BIT_WRITE_DATA                      ((u32)0x00000001 << 0)                              /*!<W 0  1 to set, 0 to clear bit with 1. */
/** @} */

/**************************************************************************//**
 * @defgroup SDIOHOST_CLKGEN_CTL
 * @brief  Clock Generator Control                   (@ 0XA44)
 * @{
 *****************************************************************************/
#define SDIOHOST_SHIFT_SD30_SAMPLE_CHANGE            18
#define SDIOHOST_BIT_SD30_SAMPLE_CHANGE              ((u32)0x00000001 << 18)                             /*!<R/W 0  0: from sd30_sample_clk_src, 1: clk4M */
#define SDIOHOST_SHIFT_SD30_PUSH_CHANGE              17
#define SDIOHOST_BIT_SD30_PUSH_CHANGE                ((u32)0x00000001 << 17)                             /*!<R/W 0  0: from sd30_push_clk_src, clk4M */
#define SDIOHOST_SHIFT_CRC_CLK_CHANGE                16
#define SDIOHOST_BIT_CRC_CLK_CHANGE                  ((u32)0x00000001 << 16)                             /*!<R/W 0  0: from crc_clk_src, 1: clk4M */
/** @} */

/**************************************************************************//**
 * @defgroup SDIOHOST_DMA_RST
 * @brief  DMA Reset                                 (@ 0XA50)
 * @{
 *****************************************************************************/
#define SDIOHOST_SHIFT_DMABUS_INFO                   16
#define SDIOHOST_MASK_DMABUS_INFO                    ((u32)0x000000FF << 16)                             /*!<R 0   */
#define SDIOHOST_SHIFT_CUR_PE_DMA_FSM                8
#define SDIOHOST_MASK_CUR_PE_DMA_FSM                 ((u32)0x000000FF << 8)                              /*!<R 0x1   */
#define SDIOHOST_SHIFT_DMA_RST_ACK_CTL               3
#define SDIOHOST_BIT_DMA_RST_ACK_CTL                 ((u32)0x00000001 << 3)                              /*!<R/W 0   */
#define SDIOHOST_SHIFT_DMA_STOP                      2
#define SDIOHOST_BIT_DMA_STOP                        ((u32)0x00000001 << 2)                              /*!<R/W 0  Set this bit to stop dma, (suggest running dma_stop before doing software reset to avoid DMA hang) */
#define SDIOHOST_SHIFT_DMA_CFG                       1
#define SDIOHOST_BIT_DMA_CFG                         ((u32)0x00000001 << 1)                              /*!<R/W 0   */
#define SDIOHOST_SHIFT_DMA_RSTN                      0
#define SDIOHOST_BIT_DMA_RSTN                        ((u32)0x00000001 << 0)                              /*!<R/W 0x1  dma soft reset. */
/** @} */

/**************************************************************************//**
 * @defgroup SDIOHOST_DUMMY_SYS1
 * @brief  sdioh_dma_rst                             (@ 0XA58)
 * @{
 *****************************************************************************/
#define SDIOHOST_SHIFT_DMY                           1
#define SDIOHOST_MASK_DMY                            ((u32)0x7FFFFFFF << 1)                              /*!<R/W 0  Dummy bit. */
#define SDIOHOST_SHIFT_DMY0                          0
#define SDIOHOST_BIT_DMY0                            ((u32)0x00000001 << 0)                              /*!<R 0  Dummy bit, After ECOA2, bit [0] is read only type register, it presents PLL ready status  */
/** @} */

/**************************************************************************//**
 * @defgroup SDIOHOST_CLK_DET_PLL0
 * @brief  sdioh_clk_det_pll0                        (@ 0XA5C)
 * @{
 *****************************************************************************/
#define SDIOHOST_SHIFT_CLKDET_DONE_PLLSDIO           30
#define SDIOHOST_BIT_CLKDET_DONE_PLLSDIO             ((u32)0x00000001 << 30)                             /*!<R 0  Clock frequency detect status, 0: not finished, 1: done */
#define SDIOHOST_SHIFT_CLK_COUNT_PLLSDIO             13
#define SDIOHOST_MASK_CLK_COUNT_PLLSDIO              ((u32)0x0001FFFF << 13)                             /*!<R 0  Counter output of detected-clk */
#define SDIOHOST_SHIFT_REFCLK_COUNT_PLLSDIO          2
#define SDIOHOST_MASK_REFCLK_COUNT_PLLSDIO           ((u32)0x000007FF << 2)                              /*!<R 0  Counter output of ref-clk (27Mhz) */
#define SDIOHOST_SHIFT_SSC_USABLE_SDIO               0
#define SDIOHOST_BIT_SSC_USABLE_SDIO                 ((u32)0x00000001 << 0)                              /*!<R 0  PLL ready status */
/** @} */

/**************************************************************************//**
 * @defgroup SDIOHOST_CLK_DET_PLL1
 * @brief  sdioh_clk_det_pll1                        (@ 0XA60)
 * @{
 *****************************************************************************/
#define SDIOHOST_SHIFT_REG_COUNT_EN_PLLSDIO          1
#define SDIOHOST_BIT_REG_COUNT_EN_PLLSDIO            ((u32)0x00000001 << 1)                              /*!<R/W 0  Enable the counter of clk frequency detect, 0: disable, 1: start clock frequency detect */
#define SDIOHOST_SHIFT_REG_RSTN_PLLSDIO              0
#define SDIOHOST_BIT_REG_RSTN_PLLSDIO                ((u32)0x00000001 << 0)                              /*!<R/W 0  Reset, 0: reset */
/** @} */

/**************************************************************************//**
 * @defgroup SDIOHOST_BIST_CTL
 * @brief  sdioh_bist_ctl                            (@ 0XA68)
 * @{
 *****************************************************************************/
#define SDIOHOST_SHIFT_BIST_LS_HW_SEL                11
#define SDIOHOST_BIT_BIST_LS_HW_SEL                  ((u32)0x00000001 << 11)                             /*!<R 0   */
#define SDIOHOST_SHIFT_BIST_RING_BUF_DS_0            10
#define SDIOHOST_BIT_BIST_RING_BUF_DS_0              ((u32)0x00000001 << 10)                             /*!<R 0  DS0 */
#define SDIOHOST_SHIFT_BIST_RING_BUF_SD_0            9
#define SDIOHOST_BIT_BIST_RING_BUF_SD_0              ((u32)0x00000001 << 9)                              /*!<R 0  SD0 */
#define SDIOHOST_SHIFT_BIST_RING_BUF_RME_0           8
#define SDIOHOST_BIT_BIST_RING_BUF_RME_0             ((u32)0x00000001 << 8)                              /*!<R 0  RM0 enable */
#define SDIOHOST_SHIFT_BIST_RING_BUF_RM_0            4
#define SDIOHOST_MASK_BIST_RING_BUF_RM_0             ((u32)0x0000000F << 4)                              /*!<R 0  RM0 value */
#define SDIOHOST_SHIFT_BIST_LS                       0
#define SDIOHOST_MASK_BIST_LS                        ((u32)0x00000003 << 0)                              /*!<R 0  Bist ls bit. */
/** @} */

/**************************************************************************//**
 * @defgroup SDIOHOST_DUMMY
 * @brief  sdioh_dummy                               (@ 0XAF0)
 * @{
 *****************************************************************************/
#define SDIOHOST_SHIFT_DMY1                          0
#define SDIOHOST_MASK_DMY1                           ((u32)0xFFFFFFFF << 0)                              /*!<R/W 0  Dummy bit. */
/** @} */

/**************************************************************************//**
 * @defgroup SDIOHOST_MUX_CTL
 * @brief  sdioh_mux_ctl                             (@ 0XB6F)
 * @{
 *****************************************************************************/
#define SDIOHOST_SHIFT_SDIO_POWER_DLY_EN             7
#define SDIOHOST_BIT_SDIO_POWER_DLY_EN               ((u32)0x00000001 << 7)                              /*!<R/W 1  sdio_power_dly_en 0: turn on sdio power entirely without delay 1: turn on sdio power sequentially, with 5ms delay */
#define SDIOHOST_SHIFT_CMD_USE_AFIFO_SYNC            6
#define SDIOHOST_BIT_CMD_USE_AFIFO_SYNC              ((u32)0x00000001 << 6)                              /*!<R/W 1  CMD use AFIFO sync */
#define SDIOHOST_SHIFT_UTUNING_ERR                   5
#define SDIOHOST_BIT_UTUNING_ERR                     ((u32)0x00000001 << 5)                              /*!<R/W 0  U Tuning error */
#define SDIOHOST_SHIFT_DATA_TOUT_CLK                 4
#define SDIOHOST_BIT_DATA_TOUT_CLK                   ((u32)0x00000001 << 4)                              /*!<R/W 0  Data Tout clk option */
#define SDIOHOST_SHIFT_CARD_INT_PERIOD_EN            3
#define SDIOHOST_BIT_CARD_INT_PERIOD_EN              ((u32)0x00000001 << 3)                              /*!<R/W 1  Card int period enable */
/** @} */

/**************************************************************************//**
 * @defgroup SDIOHOST_BUS_TA_TIME
 * @brief  sdioh_bus_ta_time                         (@ 0XB74)
 * @{
 *****************************************************************************/
#define SDIOHOST_SHIFT_STOP_CLK_CTRL_CYCLE           4
#define SDIOHOST_MASK_STOP_CLK_CTRL_CYCLE            ((u32)0x00000007 << 4)                              /*!<R/W 0x2   */
#define SDIOHOST_SHIFT_TURNAROUND_TIME_EN            3
#define SDIOHOST_BIT_TURNAROUND_TIME_EN              ((u32)0x00000001 << 3)                              /*!<R/W 0   */
#define SDIOHOST_SHIFT_BUS_TA_TIME                   0
#define SDIOHOST_MASK_BUS_TA_TIME                    ((u32)0x00000007 << 0)                              /*!<R/W 0x3  Bus_TA_Time These bits are used to define the number of SDCLK periods that HW should wait for SD bus turn-around time. After sending the end bit of command, HW will wait at least Bus_TA_Time to start to receive the start bit of response from card. After sending the end bit of write block, HW will also wait at least Bus_TA_Time to start to receive the start bit of CRC status from card. */
/** @} */

/**************************************************************************//**
 * @defgroup SDIOHOST_SDIO_MMC_MODE
 * @brief  sdioh_sdio_mmc_mode                       (@ 0XB75)
 * @{
 *****************************************************************************/
#define SDIOHOST_SHIFT_MMC_MODE                      3
#define SDIOHOST_BIT_MMC_MODE                        ((u32)0x00000001 << 3)                              /*!<RO 0  MMC Mode */
#define SDIOHOST_SHIFT_SDIO_SUPPORT                  2
#define SDIOHOST_BIT_SDIO_SUPPORT                    ((u32)0x00000001 << 2)                              /*!<RO 0  SDIO Support */
#define SDIOHOST_SHIFT_USE_DDR_TUNING                1
#define SDIOHOST_BIT_USE_DDR_TUNING                  ((u32)0x00000001 << 1)                              /*!<R/W 0  Use DDR Tuning */
#define SDIOHOST_SHIFT_USE_TX_TUNING                 0
#define SDIOHOST_BIT_USE_TX_TUNING                   ((u32)0x00000001 << 0)                              /*!<R/W 0x1  Use TX Tuning */
/** @} */

/**************************************************************************//**
 * @defgroup SDIOHOST_RX_BEST_PHASE
 * @brief  sdioh_rx_best_phase                       (@ 0XB76)
 * @{
 *****************************************************************************/
#define SDIOHOST_SHIFT_RX_BEST_PHASE                 0
#define SDIOHOST_MASK_RX_BEST_PHASE                  ((u32)0x0000001F << 0)                              /*!<RO 0  RX Best Phase */
/** @} */

/**************************************************************************//**
 * @defgroup SDIOHOST_TX_BEST_PHASE
 * @brief  sdioh_tx_best_phase                       (@ 0XB77)
 * @{
 *****************************************************************************/
#define SDIOHOST_SHIFT_TX_BEST_PHASE                 0
#define SDIOHOST_MASK_TX_BEST_PHASE                  ((u32)0x0000001F << 0)                              /*!<RO 0  TX Best Phase */
/** @} */

/**************************************************************************//**
 * @defgroup SDIOHOST_RX_PHASE0
 * @brief  sdioh_rx_phase0                           (@ 0XB78)
 * @{
 *****************************************************************************/
#define SDIOHOST_SHIFT_RX_PHASE_RESULT               0
#define SDIOHOST_MASK_RX_PHASE_RESULT                ((u32)0x000000FF << 0)                              /*!<RO 0  RX Phase Result [7:0] */
/** @} */

/**************************************************************************//**
 * @defgroup SDIOHOST_RX_PHASE1
 * @brief  sdioh_rx_phase1                           (@ 0XB79)
 * @{
 *****************************************************************************/
#define SDIOHOST_SHIFT_RX_PHASE_RESULT               0
#define SDIOHOST_MASK_RX_PHASE_RESULT                ((u32)0x000000FF << 0)                              /*!<RO 0  RX Phase Result [15:8] */
/** @} */

/**************************************************************************//**
 * @defgroup SDIOHOST_RX_PHASE2
 * @brief  sdioh_rx_phase2                           (@ 0XB7A)
 * @{
 *****************************************************************************/
#define SDIOHOST_SHIFT_RX_PHASE_RESULT               0
#define SDIOHOST_MASK_RX_PHASE_RESULT                ((u32)0x000000FF << 0)                              /*!<RO 0  RX Phase Result [23:16] */
/** @} */

/**************************************************************************//**
 * @defgroup SDIOHOST_RX_PHASE3
 * @brief  sdioh_rx_phase3                           (@ 0XB7B)
 * @{
 *****************************************************************************/
#define SDIOHOST_SHIFT_RX_PHASE_RESULT               0
#define SDIOHOST_MASK_RX_PHASE_RESULT                ((u32)0x000000FF << 0)                              /*!<RO 0  RX Phase Result [31:24] */
/** @} */

/**************************************************************************//**
 * @defgroup SDIOHOST_TX_PHASE0
 * @brief  sdioh_tx_phase0                           (@ 0XB7C)
 * @{
 *****************************************************************************/
#define SDIOHOST_SHIFT_TX_PHASE_RESULT               0
#define SDIOHOST_MASK_TX_PHASE_RESULT                ((u32)0x000000FF << 0)                              /*!<RO 0  TX Phase Result [7:0] */
/** @} */

/**************************************************************************//**
 * @defgroup SDIOHOST_TX_PHASE1
 * @brief  sdioh_tx_phase1                           (@ 0XB7D)
 * @{
 *****************************************************************************/
#define SDIOHOST_SHIFT_TX_PHASE_RESULT               0
#define SDIOHOST_MASK_TX_PHASE_RESULT                ((u32)0x000000FF << 0)                              /*!<RO 0  TX Phase Result [15:8] */
/** @} */

/**************************************************************************//**
 * @defgroup SDIOHOST_TX_PHASE2
 * @brief  sdioh_tx_phase2                           (@ 0XB7E)
 * @{
 *****************************************************************************/
#define SDIOHOST_SHIFT_TX_PHASE_RESULT               0
#define SDIOHOST_MASK_TX_PHASE_RESULT                ((u32)0x000000FF << 0)                              /*!<RO 0  TX Phase Result [23:16] */
/** @} */

/**************************************************************************//**
 * @defgroup SDIOHOST_TX_PHASE3
 * @brief  sdioh_tx_phase3                           (@ 0XB7F)
 * @{
 *****************************************************************************/
#define SDIOHOST_SHIFT_TX_PHASE_RESULT               0
#define SDIOHOST_MASK_TX_PHASE_RESULT                ((u32)0x000000FF << 0)                              /*!<RO 0  TX Phase Result [31:24] */
/** @} */

