Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/lib/include/rtl8735b_sdiohost_type.h
/**************************************************************************//**
 * @defgroup SDIOHOST_PHASE_RST_TIME0
 * @brief  sdioh_phase_rst_time0                     (@ 0XB80)
 * @{
 *****************************************************************************/
#define SDIOHOST_SHIFT_PHASE_RESET_TIME_CFG0         0
#define SDIOHOST_MASK_PHASE_RESET_TIME_CFG0          ((u32)0x000000FF << 0)                              /*!<R/W 0  Phase Reset time CFG [7:0] */
/** @} */

/**************************************************************************//**
 * @defgroup SDIOHOST_PHASE_RST_TIME1
 * @brief  sdioh_phase_rst_time1                     (@ 0XB81)
 * @{
 *****************************************************************************/
#define SDIOHOST_SHIFT_PHASE_RESET_TIME_CFG1         0
#define SDIOHOST_MASK_PHASE_RESET_TIME_CFG1          ((u32)0x0000000F << 0)                              /*!<R/W 0x1  Phase Reset time CFG [11:8] */
/** @} */

/**************************************************************************//**
 * @defgroup SDIOHOST_TUNING_DUTY_CTL
 * @brief  sdioh_tuning_duty_ctl                     (@ 0XB83)
 * @{
 *****************************************************************************/
#define SDIOHOST_SHIFT_STOP_SD_CLK_EN                4
#define SDIOHOST_BIT_STOP_SD_CLK_EN                  ((u32)0x00000001 << 4)                              /*!<R/W 0  Stop SDCLK enable */
#define SDIOHOST_SHIFT_CLEAR_INTERNAL_CLK_STABLE     3
#define SDIOHOST_BIT_CLEAR_INTERNAL_CLK_STABLE       ((u32)0x00000001 << 3)                              /*!<R/W 0  Clear Internal CLK Stable */
#define SDIOHOST_SHIFT_RX_WAIT_AFIFO_RST_EN          2
#define SDIOHOST_BIT_RX_WAIT_AFIFO_RST_EN            ((u32)0x00000001 << 2)                              /*!<R/W 0  Rx wait AFIFO Reset enable */
#define SDIOHOST_SHIFT_USE_RX_DUTY_CTL               1
#define SDIOHOST_BIT_USE_RX_DUTY_CTL                 ((u32)0x00000001 << 1)                              /*!<R/W 0  Use RX Duty Control */
#define SDIOHOST_SHIFT_USE_TX_DUTY_CTL               0
#define SDIOHOST_BIT_USE_TX_DUTY_CTL                 ((u32)0x00000001 << 0)                              /*!<R/W 0  Use TX Duty Control */
/** @} */

/**************************************************************************//**
 * @defgroup SDIOHOST_TUNING_SOLN
 * @brief  sdioh_tuning_soln                         (@ 0XB84)
 * @{
 *****************************************************************************/
#define SDIOHOST_SHIFT_R_WAIT_NOSTOP_SD_CLK_EN       7
#define SDIOHOST_BIT_R_WAIT_NOSTOP_SD_CLK_EN         ((u32)0x00000001 << 7)                              /*!<R/W 0x1  Read wait no stop SD CLK enable */
#define SDIOHOST_SHIFT_SD_CLK_POLARITY_SWAP          6
#define SDIOHOST_BIT_SD_CLK_POLARITY_SWAP            ((u32)0x00000001 << 6)                              /*!<R/W 0  SDIO SDCLK polarity swap */
#define SDIOHOST_SHIFT_DDR_DIGITAL_SOLN              5
#define SDIOHOST_BIT_DDR_DIGITAL_SOLN                ((u32)0x00000001 << 5)                              /*!<R/W 0  SDIO DDR Digital solution */
#define SDIOHOST_SHIFT_DDR_FW_SOLN                   4
#define SDIOHOST_BIT_DDR_FW_SOLN                     ((u32)0x00000001 << 4)                              /*!<R/W 0  SDIO DDR FW solution */
#define SDIOHOST_SHIFT_DDR_PUSH_TYPE                 3
#define SDIOHOST_BIT_DDR_PUSH_TYPE                   ((u32)0x00000001 << 3)                              /*!<R/W 0x1  SDIO DDR Push Type */
#define SDIOHOST_SHIFT_DDR_DAT_PUSH_PT               2
#define SDIOHOST_BIT_DDR_DAT_PUSH_PT                 ((u32)0x00000001 << 2)                              /*!<R/W 0  SDIO DDR DAT Push Point 0: set-up time: 1/4 SDCLK cycle; hold time: 1/4 SDCLK cycle, sd20_dato (trigged by crc_clk rising edge) 1: set-up time: 1/2 SDCLK cycle; hold time: 0 SDCLK cycle, sd30_dato (trigged by crc_clk falling edge) */
#define SDIOHOST_SHIFT_DDR_CMD_PUSH_PY               1
#define SDIOHOST_BIT_DDR_CMD_PUSH_PY                 ((u32)0x00000001 << 1)                              /*!<R/W 0x1  SDIO DDR CMD Push Point 0: output at falling edge of SDCLK(set-up time: 1/2 SDCLK cycle; hold time: 1/2 SDCLK cycle), sd30_cmdo (trigged by crc_clk falling edge) 1: output is ahead by 1/4 SDCLK period(set-up time: 3/4 SDCLK cycle; hold time: 1/4 SDCLK cycle), sd20_cmdo (trigged by crc_clk rising edge) */
#define SDIOHOST_SHIFT_SD20_PUSH_PT                  0
#define SDIOHOST_BIT_SD20_PUSH_PT                    ((u32)0x00000001 << 0)                              /*!<R/W 0  SDIO SD20 Push Point 0: output at falling edge of SDCLK(set-up time: 1/2 SDCLK cycle; hold time: 1/2 SDCLK cycle), sd20_cmdo/sd20_dato (trigged by crc_clk rising edge) 1: output is ahead by 1/4 SDCLK period(set-up time: 3/4 SDCLK cycle; hold time: 1/4 SDCLK cycle), sd30_cmdo/sd30_dato (trigged by crc_clk falling edge) */
/** @} */

/**************************************************************************//**
 * @defgroup SDIOHOST_SAMPLE_PT_CTL
 * @brief  sdioh_sample_pt_ctl                       (@ 0XB85)
 * @{
 *****************************************************************************/
#define SDIOHOST_SHIFT_SD20_SAMPLE_PT_SEL            3
#define SDIOHOST_BIT_SD20_SAMPLE_PT_SEL              ((u32)0x00000001 << 3)                              /*!<R/W 0  Sample Point Selection for SD20 CMD / DATA 0: sample at rising edge of SDCLK 1: sample point is delayed by 1/4 SDCLK period */
/** @} */

/**************************************************************************//**
 * @defgroup SDIOHOST_DMA_BUF_CTL
 * @brief  sdioh_dma_buf_ctl                         (@ 0XB86)
 * @{
 *****************************************************************************/
#define SDIOHOST_SHIFT_BUF_FLUSH_CTL_PIO             6
#define SDIOHOST_BIT_BUF_FLUSH_CTL_PIO               ((u32)0x00000001 << 6)                              /*!<R/W 1   */
#define SDIOHOST_SHIFT_BUF_FLUSH_CTL                 5
#define SDIOHOST_BIT_BUF_FLUSH_CTL                   ((u32)0x00000001 << 5)                              /*!<R/W 1   */
#define SDIOHOST_SHIFT_BUF_ROOM_VLD_CTL              4
#define SDIOHOST_BIT_BUF_ROOM_VLD_CTL                ((u32)0x00000001 << 4)                              /*!<R/W 1   */
#define SDIOHOST_SHIFT_AUTO_CMD23_INHISHIFT_CTL      2
#define SDIOHOST_BIT_AUTO_CMD23_INHIBIT_CTL          ((u32)0x00000001 << 2)                              /*!<R/W 0   */
#define SDIOHOST_SHIFT_AUTO_CMD23_COMPLETE_CTL       1
#define SDIOHOST_BIT_AUTO_CMD23_COMPLETE_CTL         ((u32)0x00000001 << 1)                              /*!<R/W 0   */
#define SDIOHOST_SHIFT_AUTO_CMD23_ERR_CTL            0
#define SDIOHOST_BIT_AUTO_CMD23_ERR_CTL              ((u32)0x00000001 << 0)                              /*!<R/W 0   */
/** @} */

/**************************************************************************//**
 * @defgroup SDIOHOST_SDMA_SYS_ADDR
 * @brief  SDMA System Address / Argument 2 Register (@ 0XC00)
 * @{
 *****************************************************************************/
#define SDIOHOST_SHIFT_SDMA_SYS_ADDR                 0
#define SDIOHOST_MASK_SDMA_SYS_ADDR                  ((u32)0xFFFFFFFF << 0)                              /*!<R/W 0   */
/** @} */

/**************************************************************************//**
 * @defgroup SDIOHOST_BLK_SZ
 * @brief  Block Size Register                       (@ 0XC04)
 * @{
 *****************************************************************************/
#define SDIOHOST_SHIFT_HOST_SDMA_BUFF_BOUNDARY       12
#define SDIOHOST_MASK_HOST_SDMA_BUFF_BOUNDARY        ((u32)0x00000007 << 12)                             /*!<R/W 0   */
#define SDIOHOST_SHIFT_XFER_BLK_SZ                   0
#define SDIOHOST_MASK_XFER_BLK_SZ                    ((u32)0x00000FFF << 0)                              /*!<R/W 0   */
/** @} */

/**************************************************************************//**
 * @defgroup SDIOHOST_BLK_CNT
 * @brief  Block Count Register                      (@ 0XC06)
 * @{
 *****************************************************************************/
#define SDIOHOST_SHIFT_BLK_CNT_CURR                  0
#define SDIOHOST_MASK_BLK_CNT_CURR                   ((u32)0x0000FFFF << 0)                              /*!<R/W 0   */
/** @} */

/**************************************************************************//**
 * @defgroup SDIOHOST_CMD_ARG1
 * @brief  Argument 1 Register                       (@ 0XC08)
 * @{
 *****************************************************************************/
#define SDIOHOST_SHIFT_CMD_ARG1                      0
#define SDIOHOST_MASK_CMD_ARG1                       ((u32)0xFFFFFFFF << 0)                              /*!<R/W 0   */
/** @} */

/**************************************************************************//**
 * @defgroup SDIOHOST_XFER_MODE
 * @brief   Transfer Mode Register                   (@ 0XC0C)
 * @{
 *****************************************************************************/
#define SDIOHOST_SHIFT_MULTI_SINGLE_BLK_SEL          5
#define SDIOHOST_BIT_MULTI_SINGLE_BLK_SEL            ((u32)0x00000001 << 5)                              /*!<R/W 0   */
#define SDIOHOST_SHIFT_XFER_DIR_SEL                  4
#define SDIOHOST_BIT_XFER_DIR_SEL                    ((u32)0x00000001 << 4)                              /*!<R/W 0   */
#define SDIOHOST_SHIFT_AUTO_CMD_EN                   2
#define SDIOHOST_MASK_AUTO_CMD_EN                    ((u32)0x00000003 << 2)                              /*!<R/W 0   */
#define SDIOHOST_SHIFT_BLK_CNT_EN                    1
#define SDIOHOST_BIT_BLK_CNT_EN                      ((u32)0x00000001 << 1)                              /*!<R/W 0   */
#define SDIOHOST_SHIFT_DMA_EN                        0
#define SDIOHOST_BIT_DMA_EN                          ((u32)0x00000001 << 0)                              /*!<R/W 0   */
/** @} */

/**************************************************************************//**
 * @defgroup SDIOHOST_CMD
 * @brief  Command Register                          (@ 0XC0E)
 * @{
 *****************************************************************************/
#define SDIOHOST_SHIFT_CMD_IDX                       8
#define SDIOHOST_MASK_CMD_IDX                        ((u32)0x0000003F << 8)                              /*!<R/W 0   */
#define SDIOHOST_SHIFT_CMD_TYPE                      6
#define SDIOHOST_MASK_CMD_TYPE                       ((u32)0x00000003 << 6)                              /*!<R/W 0   */
#define SDIOHOST_SHIFT_DATA_PRESENT_SEL              5
#define SDIOHOST_BIT_DATA_PRESENT_SEL                ((u32)0x00000001 << 5)                              /*!<R/W 0   */
#define SDIOHOST_SHIFT_CMD_IDX_CHK_EN                4
#define SDIOHOST_BIT_CMD_IDX_CHK_EN                  ((u32)0x00000001 << 4)                              /*!<R/W 0   */
#define SDIOHOST_SHIFT_CMD_CRC_CHK_EN                3
#define SDIOHOST_BIT_CMD_CRC_CHK_EN                  ((u32)0x00000001 << 3)                              /*!<R/W 0   */
#define SDIOHOST_SHIFT_RESP_TYPE_SEL                 0
#define SDIOHOST_MASK_RESP_TYPE_SEL                  ((u32)0x00000003 << 0)                              /*!<R/W 0   */
/** @} */

/**************************************************************************//**
 * @defgroup SDIOHOST_RESP0
 * @brief  Response Register                         (@ 0XC10)
 * @{
 *****************************************************************************/
#define SDIOHOST_SHIFT_CMD_RESP                      0
#define SDIOHOST_MASK_CMD_RESP                       ((u32)0xFFFFFFFF << 0)                              /*!<RO 0   */
/** @} */

/**************************************************************************//**
 * @defgroup SDIOHOST_RESP1
 * @brief  Response Register                         (@ 0XC14)
 * @{
 *****************************************************************************/
#define SDIOHOST_SHIFT_CMD_RESP                      0
#define SDIOHOST_MASK_CMD_RESP                       ((u32)0xFFFFFFFF << 0)                              /*!<RO 0   */
/** @} */

/**************************************************************************//**
 * @defgroup SDIOHOST_RESP2
 * @brief  Response Register                         (@ 0XC18)
 * @{
 *****************************************************************************/
#define SDIOHOST_SHIFT_CMD_RESP                      0
#define SDIOHOST_MASK_CMD_RESP                       ((u32)0xFFFFFFFF << 0)                              /*!<RO 0   */
/** @} */

/**************************************************************************//**
 * @defgroup SDIOHOST_RESP3
 * @brief  Response Register                         (@ 0XC1C)
 * @{
 *****************************************************************************/
#define SDIOHOST_SHIFT_CMD_RESP                      0
#define SDIOHOST_MASK_CMD_RESP                       ((u32)0xFFFFFFFF << 0)                              /*!<RO 0   */
/** @} */

/**************************************************************************//**
 * @defgroup SDIOHOST_BUFFER_PORT_DATA
 * @brief   Buffer Data Port Register                (@ 0XC20)
 * @{
 *****************************************************************************/
#define SDIOHOST_SHIFT_BUFF_DATA                     0
#define SDIOHOST_MASK_BUFF_DATA                      ((u32)0xFFFFFFFF << 0)                              /*!<R/W 0   */
/** @} */

/**************************************************************************//**
 * @defgroup SDIOHOST_PRESENT_STATE
 * @brief  ADC Debug Select Register                 (@ 0XC24)
 * @{
 *****************************************************************************/
#define SDIOHOST_SHIFT_CMD_LINE_SIG_LVL              24
#define SDIOHOST_BIT_CMD_LINE_SIG_LVL                ((u32)0x00000001 << 24)                             /*!<RO 0   */
#define SDIOHOST_SHIFT_DAT_LINE_SIG_LVL              20
#define SDIOHOST_MASK_DAT_LINE_SIG_LVL               ((u32)0x0000000F << 20)                             /*!<RO 0   */
#define SDIOHOST_SHIFT_WP_SWITCH_PIN_LVL             19
#define SDIOHOST_BIT_WP_SWITCH_PIN_LVL               ((u32)0x00000001 << 19)                             /*!<RO 0   */
#define SDIOHOST_SHIFT_CD_PIN_LEVEL                  18
#define SDIOHOST_BIT_CD_PIN_LEVEL                    ((u32)0x00000001 << 18)                             /*!<RO 0   */
#define SDIOHOST_SHIFT_CARD_STATE_STABLE             17
#define SDIOHOST_BIT_CARD_STATE_STABLE               ((u32)0x00000001 << 17)                             /*!<RO 0   */
#define SDIOHOST_SHIFT_CARD_INSERTED                 16
#define SDIOHOST_BIT_CARD_INSERTED                   ((u32)0x00000001 << 16)                             /*!<RO 0   */
#define SDIOHOST_SHIFT_BUFF_READ_EN                  11
#define SDIOHOST_BIT_BUFF_READ_EN                    ((u32)0x00000001 << 11)                             /*!<RO 0   */
#define SDIOHOST_SHIFT_BUFF_WRITE_EN                 10
#define SDIOHOST_BIT_BUFF_WRITE_EN                   ((u32)0x00000001 << 10)                             /*!<RO 0   */
#define SDIOHOST_SHIFT_READ_XFER_ACTIVE              9
#define SDIOHOST_BIT_READ_XFER_ACTIVE                ((u32)0x00000001 << 9)                              /*!<RO 0   */
#define SDIOHOST_SHIFT_WRITE_XFER_ACTIVE             8
#define SDIOHOST_BIT_WRITE_XFER_ACTIVE               ((u32)0x00000001 << 8)                              /*!<RO 0   */
#define SDIOHOST_SHIFT_RETUNE_REQ                    3
#define SDIOHOST_BIT_RETUNE_REQ                      ((u32)0x00000001 << 3)                              /*!<RO 0   */
#define SDIOHOST_SHIFT_DAT_LINE_ACTIVE               2
#define SDIOHOST_BIT_DAT_LINE_ACTIVE                 ((u32)0x00000001 << 2)                              /*!<RO 0   */
#define SDIOHOST_SHIFT_CMD_INHISHIFT_DAT             1
#define SDIOHOST_BIT_CMD_INHIBIT_DAT                 ((u32)0x00000001 << 1)                              /*!<RO 0   */
#define SDIOHOST_SHIFT_CMD_INHISHIFT_CMD             0
#define SDIOHOST_BIT_CMD_INHIBIT_CMD                 ((u32)0x00000001 << 0)                              /*!<RO 0   */
/** @} */

/**************************************************************************//**
 * @defgroup SDIOHOST_HOST_CTL_1_REG
 * @brief  Host Control 1 Register                   (@ 0XC28)
 * @{
 *****************************************************************************/
#define SDIOHOST_SHIFT_CD_SIG_SEL                    7
#define SDIOHOST_BIT_CD_SIG_SEL                      ((u32)0x00000001 << 7)                              /*!<R/W 0   */
#define SDIOHOST_SHIFT_CD_TEST_LVL                   6
#define SDIOHOST_BIT_CD_TEST_LVL                     ((u32)0x00000001 << 6)                              /*!<R/W 0   */
#define SDIOHOST_SHIFT_EXTENDED_DATA_XFER_WIDTH      5
#define SDIOHOST_BIT_EXTENDED_DATA_XFER_WIDTH        ((u32)0x00000001 << 5)                              /*!<R/W 0   */
#define SDIOHOST_SHIFT_DMA_SEL                       3
#define SDIOHOST_MASK_DMA_SEL                        ((u32)0x00000003 << 3)                              /*!<R/W 0   */
#define SDIOHOST_SHIFT_HS_EN                         2
#define SDIOHOST_BIT_HS_EN                           ((u32)0x00000001 << 2)                              /*!<R/W 0   */
#define SDIOHOST_SHIFT_DATA_XFER_WIDTH               1
#define SDIOHOST_BIT_DATA_XFER_WIDTH                 ((u32)0x00000001 << 1)                              /*!<R/W 0   */
#define SDIOHOST_SHIFT_LED_CTL                       0
#define SDIOHOST_BIT_LED_CTL                         ((u32)0x00000001 << 0)                              /*!<R/W 0   */
/** @} */

/**************************************************************************//**
 * @defgroup SDIOHOST_PWR_CTL
 * @brief  Power Control Register                    (@ 0XC29)
 * @{
 *****************************************************************************/
#define SDIOHOST_SHIFT_SD_BUS_VOLTAGE_SEL            1
#define SDIOHOST_MASK_SD_BUS_VOLTAGE_SEL             ((u32)0x00000007 << 1)                              /*!<R/W 0   */
#define SDIOHOST_SHIFT_SD_BUS_PWR                    0
#define SDIOHOST_BIT_SD_BUS_PWR                      ((u32)0x00000001 << 0)                              /*!<R/W 0   */
/** @} */

/**************************************************************************//**
 * @defgroup SDIOHOST_BLK_GAP_CTL
 * @brief  Block Gap Control Register                (@ 0XC2A)
 * @{
 *****************************************************************************/
#define SDIOHOST_SHIFT_INT_AT_BLK_GAP                3
#define SDIOHOST_BIT_INT_AT_BLK_GAP                  ((u32)0x00000001 << 3)                              /*!<R/W 0   */
#define SDIOHOST_SHIFT_READ_WAIT_CTL                 2
#define SDIOHOST_BIT_READ_WAIT_CTL                   ((u32)0x00000001 << 2)                              /*!<R/W 0   */
#define SDIOHOST_SHIFT_CONT_REQ                      1
#define SDIOHOST_BIT_CONT_REQ                        ((u32)0x00000001 << 1)                              /*!<R/W 0   */
#define SDIOHOST_SHIFT_STOP_AT_BLK_REQ               0
#define SDIOHOST_BIT_STOP_AT_BLK_REQ                 ((u32)0x00000001 << 0)                              /*!<R/W 0   */
/** @} */

/**************************************************************************//**
 * @defgroup SDIOHOST_WAKEUP_CTL
 * @brief  Wakeup Control Register                   (@ 0XC2B)
 * @{
 *****************************************************************************/
#define SDIOHOST_SHIFT_WAKEUP_EVENT_CARD_REMOVE_EN   2
#define SDIOHOST_BIT_WAKEUP_EVENT_CARD_REMOVE_EN     ((u32)0x00000001 << 2)                              /*!<R/W 0   */
#define SDIOHOST_SHIFT_WAKEUP_EVENT_CARD_INSERT_EN   1
#define SDIOHOST_BIT_WAKEUP_EVENT_CARD_INSERT_EN     ((u32)0x00000001 << 1)                              /*!<R/W 0   */
#define SDIOHOST_SHIFT_WAKEUP_EVENT_CARD_INT_EN      0
#define SDIOHOST_BIT_WAKEUP_EVENT_CARD_INT_EN        ((u32)0x00000001 << 0)                              /*!<R/W 0   */
/** @} */

/**************************************************************************//**
 * @defgroup SDIOHOST_CLK_CTL
 * @brief   Clock Control Register                   (@ 0XC2C)
 * @{
 *****************************************************************************/
#define SDIOHOST_SHIFT_SDCLK_FREQ_SEL                8
#define SDIOHOST_MASK_SDCLK_FREQ_SEL                 ((u32)0x000000FF << 8)                              /*!<R/W 0    */
#define SDIOHOST_SHIFT_SDCLK_FREQ_SEL_UPPER          6
#define SDIOHOST_MASK_SDCLK_FREQ_SEL_UPPER           ((u32)0x00000003 << 6)                              /*!<R/W 0    */
#define SDIOHOST_SHIFT_CLK_GEN_SEL                   5
#define SDIOHOST_BIT_CLK_GEN_SEL                     ((u32)0x00000001 << 5)                              /*!<R/W 0    */
#define SDIOHOST_SHIFT_SDCLK_EN                      2
#define SDIOHOST_BIT_SDCLK_EN                        ((u32)0x00000001 << 2)                              /*!<R/W 0    */
#define SDIOHOST_SHIFT_INTERNAL_CLK_STABLE           1
#define SDIOHOST_BIT_INTERNAL_CLK_STABLE             ((u32)0x00000001 << 1)                              /*!<RO 0   */
#define SDIOHOST_SHIFT_INTERNAL_CLK_EN               0
#define SDIOHOST_BIT_INTERNAL_CLK_EN                 ((u32)0x00000001 << 0)                              /*!<R/W 0   */
/** @} */

/**************************************************************************//**
 * @defgroup SDIOHOST_TIMEOUT_CTL
 * @brief  Timeout Control Register                  (@ 0XC2E)
 * @{
 *****************************************************************************/
#define SDIOHOST_SHIFT_DATA_TIMEOUT_CNT_VAL          0
#define SDIOHOST_MASK_DATA_TIMEOUT_CNT_VAL           ((u32)0x0000000F << 0)                              /*!<R/W 0   */
/** @} */

/**************************************************************************//**
 * @defgroup SDIOHOST_SW_RST
 * @brief  Software Reset Register                   (@ 0XC2F)
 * @{
 *****************************************************************************/
#define SDIOHOST_SHIFT_SW_RST_DAT                    2
#define SDIOHOST_BIT_SW_RST_DAT                      ((u32)0x00000001 << 2)                              /*!<R/W 0   */
#define SDIOHOST_SHIFT_SW_RST_CMD                    1
#define SDIOHOST_BIT_SW_RST_CMD                      ((u32)0x00000001 << 1)                              /*!<R/W 0   */
#define SDIOHOST_SHIFT_SW_RST_ALL                    0
#define SDIOHOST_BIT_SW_RST_ALL                      ((u32)0x00000001 << 0)                              /*!<R/W 0   */
/** @} */

