Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/lib/include/rtl8735b_sdiohost_type.h
/**************************************************************************//**
 * @defgroup SDIOHOST_NORMAL_INT_STATUS
 * @brief  Normal Interrupt Status Register          (@ 0XC30)
 * @{
 *****************************************************************************/
#define SDIOHOST_SHIFT_ERR_INT                       15
#define SDIOHOST_BIT_ERR_INT                         ((u32)0x00000001 << 15)                             /*!<RO 0   */
#define SDIOHOST_SHIFT_RETUNING_EVENT                12
#define SDIOHOST_BIT_RETUNING_EVENT                  ((u32)0x00000001 << 12)                             /*!<RO 0   */
#define SDIOHOST_SHIFT_INT_C                         11
#define SDIOHOST_BIT_INT_C                           ((u32)0x00000001 << 11)                             /*!<RO 0   */
#define SDIOHOST_SHIFT_INT_B                         10
#define SDIOHOST_BIT_INT_B                           ((u32)0x00000001 << 10)                             /*!<RO 0   */
#define SDIOHOST_SHIFT_INT_A                         9
#define SDIOHOST_BIT_INT_A                           ((u32)0x00000001 << 9)                              /*!<RO 0   */
#define SDIOHOST_SHIFT_CARD_INT                      8
#define SDIOHOST_BIT_CARD_INT                        ((u32)0x00000001 << 8)                              /*!<RO 0   */
#define SDIOHOST_SHIFT_CARD_REMOVAL                  7
#define SDIOHOST_BIT_CARD_REMOVAL                    ((u32)0x00000001 << 7)                              /*!<R/W1C 0   */
#define SDIOHOST_SHIFT_CARD_INSERTION                6
#define SDIOHOST_BIT_CARD_INSERTION                  ((u32)0x00000001 << 6)                              /*!<R/W1C 0   */
#define SDIOHOST_SHIFT_BUFF_READ_READY               5
#define SDIOHOST_BIT_BUFF_READ_READY                 ((u32)0x00000001 << 5)                              /*!<R/W1C 0   */
#define SDIOHOST_SHIFT_BUFF_WRITE_READY              4
#define SDIOHOST_BIT_BUFF_WRITE_READY                ((u32)0x00000001 << 4)                              /*!<R/W1C 0   */
#define SDIOHOST_SHIFT_DMA_INT                       3
#define SDIOHOST_BIT_DMA_INT                         ((u32)0x00000001 << 3)                              /*!<R/W1C 0   */
#define SDIOHOST_SHIFT_BLK_GAP_EVENT                 2
#define SDIOHOST_BIT_BLK_GAP_EVENT                   ((u32)0x00000001 << 2)                              /*!<R/W1C 0   */
#define SDIOHOST_SHIFT_XFER_COMPLETE                 1
#define SDIOHOST_BIT_XFER_COMPLETE                   ((u32)0x00000001 << 1)                              /*!<R/W1C 0   */
#define SDIOHOST_SHIFT_CMD_COMPLETE                  0
#define SDIOHOST_BIT_CMD_COMPLETE                    ((u32)0x00000001 << 0)                              /*!<R/W1C 0   */
/** @} */

/**************************************************************************//**
 * @defgroup SDIOHOST_ERR_INT_STATUS
 * @brief  Error Interrupt Status Register           (@ 0XC32)
 * @{
 *****************************************************************************/
#define SDIOHOST_SHIFT_VENDOR_SPECIFIC_ERR           12
#define SDIOHOST_MASK_VENDOR_SPECIFIC_ERR            ((u32)0x0000000F << 12)                             /*!<R/W1C 0   */
#define SDIOHOST_SHIFT_TUNING_ERR                    10
#define SDIOHOST_BIT_TUNING_ERR                      ((u32)0x00000001 << 10)                             /*!<R/W1C 0   */
#define SDIOHOST_SHIFT_ADMA_ERR                      9
#define SDIOHOST_BIT_ADMA_ERR                        ((u32)0x00000001 << 9)                              /*!<R/W1C 0   */
#define SDIOHOST_SHIFT_AUTO_CMD_ERR                  8
#define SDIOHOST_BIT_AUTO_CMD_ERR                    ((u32)0x00000001 << 8)                              /*!<R/W1C 0   */
#define SDIOHOST_SHIFT_CURRENT_LIMIT_ERR             7
#define SDIOHOST_BIT_CURRENT_LIMIT_ERR               ((u32)0x00000001 << 7)                              /*!<R/W1C 0   */
#define SDIOHOST_SHIFT_DATA_END_SHIFT_ERR            6
#define SDIOHOST_BIT_DATA_END_BIT_ERR                ((u32)0x00000001 << 6)                              /*!<R/W1C 0   */
#define SDIOHOST_SHIFT_DATA_CRC_ERR                  5
#define SDIOHOST_BIT_DATA_CRC_ERR                    ((u32)0x00000001 << 5)                              /*!<R/W1C 0   */
#define SDIOHOST_SHIFT_DATA_TIMEOUT_ERR              4
#define SDIOHOST_BIT_DATA_TIMEOUT_ERR                ((u32)0x00000001 << 4)                              /*!<R/W1C 0   */
#define SDIOHOST_SHIFT_CMD_IDX_ERR                   3
#define SDIOHOST_BIT_CMD_IDX_ERR                     ((u32)0x00000001 << 3)                              /*!<R/W1C 0   */
#define SDIOHOST_SHIFT_CMD_END_SHIFT_ERR             2
#define SDIOHOST_BIT_CMD_END_BIT_ERR                 ((u32)0x00000001 << 2)                              /*!<R/W1C 0   */
#define SDIOHOST_SHIFT_CMD_CRC_ERR                   1
#define SDIOHOST_BIT_CMD_CRC_ERR                     ((u32)0x00000001 << 1)                              /*!<R/W1C 0   */
#define SDIOHOST_SHIFT_CMD_TIMEOUT_ERR               0
#define SDIOHOST_BIT_CMD_TIMEOUT_ERR                 ((u32)0x00000001 << 0)                              /*!<R/W1C 0   */
/** @} */

/**************************************************************************//**
 * @defgroup SDIOHOST_NORMAL_INT_STATUS_EN
 * @brief  Normal Interrupt Status Enable Register   (@ 0XC34)
 * @{
 *****************************************************************************/
#define SDIOHOST_SHIFT_FIXED_TO_0                    15
#define SDIOHOST_BIT_FIXED_TO_0                      ((u32)0x00000001 << 15)                             /*!<RO 0   */
#define SDIOHOST_SHIFT_RETUNE_EVENT_STATUS_EN        12
#define SDIOHOST_BIT_RETUNE_EVENT_STATUS_EN          ((u32)0x00000001 << 12)                             /*!<R/W 0   */
#define SDIOHOST_SHIFT_INT_C_STATUS_EN               11
#define SDIOHOST_BIT_INT_C_STATUS_EN                 ((u32)0x00000001 << 11)                             /*!<R/W 0   */
#define SDIOHOST_SHIFT_INT_B_STATUS_EN               10
#define SDIOHOST_BIT_INT_B_STATUS_EN                 ((u32)0x00000001 << 10)                             /*!<R/W 0   */
#define SDIOHOST_SHIFT_INT_A_STATUS_EN               9
#define SDIOHOST_BIT_INT_A_STATUS_EN                 ((u32)0x00000001 << 9)                              /*!<R/W 0   */
#define SDIOHOST_SHIFT_CARD_INT_STATUS_EN            8
#define SDIOHOST_BIT_CARD_INT_STATUS_EN              ((u32)0x00000001 << 8)                              /*!<R/W 0   */
#define SDIOHOST_SHIFT_CARD_REMOVAL_STATUS_EN        7
#define SDIOHOST_BIT_CARD_REMOVAL_STATUS_EN          ((u32)0x00000001 << 7)                              /*!<R/W 0   */
#define SDIOHOST_SHIFT_CARD_INSERT_STATUS_EN         6
#define SDIOHOST_BIT_CARD_INSERT_STATUS_EN           ((u32)0x00000001 << 6)                              /*!<R/W 0   */
#define SDIOHOST_SHIFT_BUFF_READ_READY_STATUS_EN     5
#define SDIOHOST_BIT_BUFF_READ_READY_STATUS_EN       ((u32)0x00000001 << 5)                              /*!<R/W 0   */
#define SDIOHOST_SHIFT_BUFF_WRITE_READY_STATUS_EN    4
#define SDIOHOST_BIT_BUFF_WRITE_READY_STATUS_EN      ((u32)0x00000001 << 4)                              /*!<R/W 0   */
#define SDIOHOST_SHIFT_DMA_INT_STATUS_EN             3
#define SDIOHOST_BIT_DMA_INT_STATUS_EN               ((u32)0x00000001 << 3)                              /*!<R/W 0   */
#define SDIOHOST_SHIFT_BLK_GAP_EVENT_STATUS_EN       2
#define SDIOHOST_BIT_BLK_GAP_EVENT_STATUS_EN         ((u32)0x00000001 << 2)                              /*!<R/W 0   */
#define SDIOHOST_SHIFT_XFER_COMPLETE_STATUS_EN       1
#define SDIOHOST_BIT_XFER_COMPLETE_STATUS_EN         ((u32)0x00000001 << 1)                              /*!<R/W 0   */
#define SDIOHOST_SHIFT_CMD_COMPLETE_STATUS_EN        0
#define SDIOHOST_BIT_CMD_COMPLETE_STATUS_EN          ((u32)0x00000001 << 0)                              /*!<R/W 0   */
/** @} */

/**************************************************************************//**
 * @defgroup SDIOHOST_ERR_INT_STATUS_EN
 * @brief   Error Interrupt Status Enable Register   (@ 0XC36)
 * @{
 *****************************************************************************/
#define SDIOHOST_SHIFT_VENDOR_SPECIFIC_ERR_STATUS_EN 12
#define SDIOHOST_MASK_VENDOR_SPECIFIC_ERR_STATUS_EN  ((u32)0x0000000F << 12)                             /*!<R/W 0   */
#define SDIOHOST_SHIFT_TUNING_ERR_STATUS_EN          10
#define SDIOHOST_BIT_TUNING_ERR_STATUS_EN            ((u32)0x00000001 << 10)                             /*!<R/W 0   */
#define SDIOHOST_SHIFT_ADMA_ERR_STATUS_EN            9
#define SDIOHOST_BIT_ADMA_ERR_STATUS_EN              ((u32)0x00000001 << 9)                              /*!<R/W 0   */
#define SDIOHOST_SHIFT_AUTO_CMD_ERR_STATUS_EN        8
#define SDIOHOST_BIT_AUTO_CMD_ERR_STATUS_EN          ((u32)0x00000001 << 8)                              /*!<R/W 0   */
#define SDIOHOST_SHIFT_CURRENT_LIMIT_ERR_STATUS_EN   7
#define SDIOHOST_BIT_CURRENT_LIMIT_ERR_STATUS_EN     ((u32)0x00000001 << 7)                              /*!<R/W 0   */
#define SDIOHOST_SHIFT_DATA_END_SHIFT_ERR_STATUS_EN  6
#define SDIOHOST_BIT_DATA_END_BIT_ERR_STATUS_EN      ((u32)0x00000001 << 6)                              /*!<R/W 0   */
#define SDIOHOST_SHIFT_DATA_CRC_ERR_STATUS_EN        5
#define SDIOHOST_BIT_DATA_CRC_ERR_STATUS_EN          ((u32)0x00000001 << 5)                              /*!<R/W 0   */
#define SDIOHOST_SHIFT_DATA_TIMEOUT_ERR_STATUS_EN    4
#define SDIOHOST_BIT_DATA_TIMEOUT_ERR_STATUS_EN      ((u32)0x00000001 << 4)                              /*!<R/W 0   */
#define SDIOHOST_SHIFT_CMD_IDX_ERR_STATUS_EN         3
#define SDIOHOST_BIT_CMD_IDX_ERR_STATUS_EN           ((u32)0x00000001 << 3)                              /*!<R/W 0   */
#define SDIOHOST_SHIFT_CMD_END_SHIFT_ERR_STATUS_EN   2
#define SDIOHOST_BIT_CMD_END_BIT_ERR_STATUS_EN       ((u32)0x00000001 << 2)                              /*!<R/W 0   */
#define SDIOHOST_SHIFT_CMD_CRC_ERR_STATUS_EN         1
#define SDIOHOST_BIT_CMD_CRC_ERR_STATUS_EN           ((u32)0x00000001 << 1)                              /*!<R/W 0   */
#define SDIOHOST_SHIFT_CMD_TIMEOUT_ERR_STATUS_EN     0
#define SDIOHOST_BIT_CMD_TIMEOUT_ERR_STATUS_EN       ((u32)0x00000001 << 0)                              /*!<R/W 0   */
/** @} */

/**************************************************************************//**
 * @defgroup SDIOHOST_NORMAL_SIG_EN
 * @brief  Normal Interrupt Signal Enable Register   (@ 0XC38)
 * @{
 *****************************************************************************/
#define SDIOHOST_SHIFT_FIXED_TO_0                    15
#define SDIOHOST_BIT_FIXED_TO_0                      ((u32)0x00000001 << 15)                             /*!<RO 0   */
#define SDIOHOST_SHIFT_RETUNE_EVENT_SIGNAL_EN        12
#define SDIOHOST_BIT_RETUNE_EVENT_SIGNAL_EN          ((u32)0x00000001 << 12)                             /*!<R/W 0   */
#define SDIOHOST_SHIFT_INT_C_STATUS_SIGNAL_EN        11
#define SDIOHOST_BIT_INT_C_STATUS_SIGNAL_EN          ((u32)0x00000001 << 11)                             /*!<R/W 0   */
#define SDIOHOST_SHIFT_INT_B_STATUS_SIGNAL_EN        10
#define SDIOHOST_BIT_INT_B_STATUS_SIGNAL_EN          ((u32)0x00000001 << 10)                             /*!<R/W 0   */
#define SDIOHOST_SHIFT_INT_A_SIGNAL_EN               9
#define SDIOHOST_BIT_INT_A_SIGNAL_EN                 ((u32)0x00000001 << 9)                              /*!<R/W 0   */
#define SDIOHOST_SHIFT_CARD_INT_SIGNAL_EN            8
#define SDIOHOST_BIT_CARD_INT_SIGNAL_EN              ((u32)0x00000001 << 8)                              /*!<R/W 0   */
#define SDIOHOST_SHIFT_CARD_REMOVAL_SIGNAL_EN        7
#define SDIOHOST_BIT_CARD_REMOVAL_SIGNAL_EN          ((u32)0x00000001 << 7)                              /*!<R/W 0   */
#define SDIOHOST_SHIFT_CARD_INSERT_SIGNAL_EN         6
#define SDIOHOST_BIT_CARD_INSERT_SIGNAL_EN           ((u32)0x00000001 << 6)                              /*!<R/W 0   */
#define SDIOHOST_SHIFT_BUFF_READ_READY_SIGNAL_EN     5
#define SDIOHOST_BIT_BUFF_READ_READY_SIGNAL_EN       ((u32)0x00000001 << 5)                              /*!<R/W 0   */
#define SDIOHOST_SHIFT_BUFF_WRITE_READY_SIGNAL_EN    4
#define SDIOHOST_BIT_BUFF_WRITE_READY_SIGNAL_EN      ((u32)0x00000001 << 4)                              /*!<R/W 0   */
#define SDIOHOST_SHIFT_DMA_INT_SIGNAL_EN             3
#define SDIOHOST_BIT_DMA_INT_SIGNAL_EN               ((u32)0x00000001 << 3)                              /*!<R/W 0   */
#define SDIOHOST_SHIFT_BLK_GAP_EVENT_SIGNAL_EN       2
#define SDIOHOST_BIT_BLK_GAP_EVENT_SIGNAL_EN         ((u32)0x00000001 << 2)                              /*!<R/W 0   */
#define SDIOHOST_SHIFT_XFER_COMPLETE_SIGNAL_EN       1
#define SDIOHOST_BIT_XFER_COMPLETE_SIGNAL_EN         ((u32)0x00000001 << 1)                              /*!<R/W 0   */
#define SDIOHOST_SHIFT_CMD_COMPLETE_SIGNAL_EN        0
#define SDIOHOST_BIT_CMD_COMPLETE_SIGNAL_EN          ((u32)0x00000001 << 0)                              /*!<R/W 0   */
/** @} */

/**************************************************************************//**
 * @defgroup SDIOHOST_ERR_SIG_EN
 * @brief  Error Interrupt Signal Enable Register    (@ 0XC3A)
 * @{
 *****************************************************************************/
#define SDIOHOST_SHIFT_VENDOR_SPECIFIC_ERR_SIGNAL_EN 12
#define SDIOHOST_MASK_VENDOR_SPECIFIC_ERR_SIGNAL_EN  ((u32)0x0000000F << 12)                             /*!<R/W 0   */
#define SDIOHOST_SHIFT_TUNING_ERR_SIGNAL_EN          10
#define SDIOHOST_BIT_TUNING_ERR_SIGNAL_EN            ((u32)0x00000001 << 10)                             /*!<R/W 0   */
#define SDIOHOST_SHIFT_ADMA_ERR_SIGNAL_EN            9
#define SDIOHOST_BIT_ADMA_ERR_SIGNAL_EN              ((u32)0x00000001 << 9)                              /*!<R/W 0   */
#define SDIOHOST_SHIFT_AUTO_CMD_ERR_SIGNAL_EN        8
#define SDIOHOST_BIT_AUTO_CMD_ERR_SIGNAL_EN          ((u32)0x00000001 << 8)                              /*!<R/W 0   */
#define SDIOHOST_SHIFT_CURRENT_LIMIT_ERR_SIGNAL_EN   7
#define SDIOHOST_BIT_CURRENT_LIMIT_ERR_SIGNAL_EN     ((u32)0x00000001 << 7)                              /*!<R/W 0   */
#define SDIOHOST_SHIFT_DATA_END_SHIFT_ERR_SIGNAL_EN  6
#define SDIOHOST_BIT_DATA_END_BIT_ERR_SIGNAL_EN      ((u32)0x00000001 << 6)                              /*!<R/W 0   */
#define SDIOHOST_SHIFT_DATA_CRC_ERR_SIGNAL_EN        5
#define SDIOHOST_BIT_DATA_CRC_ERR_SIGNAL_EN          ((u32)0x00000001 << 5)                              /*!<R/W 0   */
#define SDIOHOST_SHIFT_DATA_TIMEOUT_ERR_SIGNAL_EN    4
#define SDIOHOST_BIT_DATA_TIMEOUT_ERR_SIGNAL_EN      ((u32)0x00000001 << 4)                              /*!<R/W 0   */
#define SDIOHOST_SHIFT_CMD_IDX_ERR_SIGNAL_EN         3
#define SDIOHOST_BIT_CMD_IDX_ERR_SIGNAL_EN           ((u32)0x00000001 << 3)                              /*!<R/W 0   */
#define SDIOHOST_SHIFT_CMD_END_SHIFT_ERR_SIGNAL_EN   2
#define SDIOHOST_BIT_CMD_END_BIT_ERR_SIGNAL_EN       ((u32)0x00000001 << 2)                              /*!<R/W 0   */
#define SDIOHOST_SHIFT_CMD_CRC_ERR_SIGNAL_EN         1
#define SDIOHOST_BIT_CMD_CRC_ERR_SIGNAL_EN           ((u32)0x00000001 << 1)                              /*!<R/W 0   */
#define SDIOHOST_SHIFT_CMD_TIMEOUT_ERR_SIGNAL_EN     0
#define SDIOHOST_BIT_CMD_TIMEOUT_ERR_SIGNAL_EN       ((u32)0x00000001 << 0)                              /*!<R/W 0   */
/** @} */

/**************************************************************************//**
 * @defgroup SDIOHOST_AUTO_CMD_ERR_STATUS
 * @brief  Auto CMD Error Status Register            (@ 0XC3C)
 * @{
 *****************************************************************************/
#define SDIOHOST_SHIFT_CMD_NOT_ISSUED_ERR            7
#define SDIOHOST_BIT_CMD_NOT_ISSUED_ERR              ((u32)0x00000001 << 7)                              /*!<RO 0   */
#define SDIOHOST_SHIFT_IDX_ERR                       4
#define SDIOHOST_BIT_IDX_ERR                         ((u32)0x00000001 << 4)                              /*!<RO 0   */
#define SDIOHOST_SHIFT_END_SHIFT_ERR                 3
#define SDIOHOST_BIT_END_BIT_ERR                     ((u32)0x00000001 << 3)                              /*!<RO 0   */
#define SDIOHOST_SHIFT_CRC_ERR                       2
#define SDIOHOST_BIT_CRC_ERR                         ((u32)0x00000001 << 2)                              /*!<RO 0   */
#define SDIOHOST_SHIFT_TIMEOUT_ERR                   1
#define SDIOHOST_BIT_TIMEOUT_ERR                     ((u32)0x00000001 << 1)                              /*!<RO 0   */
#define SDIOHOST_SHIFT_NOT_EXE                       0
#define SDIOHOST_BIT_NOT_EXE                         ((u32)0x00000001 << 0)                              /*!<RO 0   */
/** @} */

/**************************************************************************//**
 * @defgroup SDIOHOST_HOST_CTL
 * @brief  Host Control 2 Register                   (@ 0XC3E)
 * @{
 *****************************************************************************/
#define SDIOHOST_SHIFT_PRESET_VAL_EN                 15
#define SDIOHOST_BIT_PRESET_VAL_EN                   ((u32)0x00000001 << 15)                             /*!<R/W 0   */
#define SDIOHOST_SHIFT_ASYNC_INT_EN                  14
#define SDIOHOST_BIT_ASYNC_INT_EN                    ((u32)0x00000001 << 14)                             /*!<R/W 0   */
#define SDIOHOST_SHIFT_SAMP_CLK_SEL                  7
#define SDIOHOST_BIT_SAMP_CLK_SEL                    ((u32)0x00000001 << 7)                              /*!<R/W 0   */
#define SDIOHOST_SHIFT_EXEC_TUNING                   6
#define SDIOHOST_BIT_EXEC_TUNING                     ((u32)0x00000001 << 6)                              /*!<R/W 0   */
#define SDIOHOST_SHIFT_DRV_STR_SEL                   4
#define SDIOHOST_MASK_DRV_STR_SEL                    ((u32)0x00000003 << 4)                              /*!<R/W 0   */
#define SDIOHOST_SHIFT_1_8V_SIG_EN                   3
#define SDIOHOST_BIT_1_8V_SIG_EN                     ((u32)0x00000001 << 3)                              /*!<R/W 0   */
#define SDIOHOST_SHIFT_UHS_MODE_EN                   0
#define SDIOHOST_MASK_UHS_MODE_EN                    ((u32)0x00000007 << 0)                              /*!<R/W 0   */
/** @} */

/**************************************************************************//**
 * @defgroup SDIOHOST_CAPABILITIES0
 * @brief  Capabilities Register                     (@ 0XC40)
 * @{
 *****************************************************************************/
#define SDIOHOST_SHIFT_SLOT_TYPE                     30
#define SDIOHOST_MASK_SLOT_TYPE                      ((u32)0x00000003 << 30)                             /*!<R 0   */
#define SDIOHOST_SHIFT_ASYNC_INT_SUPPORT             29
#define SDIOHOST_BIT_ASYNC_INT_SUPPORT               ((u32)0x00000001 << 29)                             /*!<R 0   */
#define SDIOHOST_SHIFT_64_SHIFT_SYS_BUS_SUPPORT      28
#define SDIOHOST_BIT_64_BIT_SYS_BUS_SUPPORT          ((u32)0x00000001 << 28)                             /*!<R 0   */
#define SDIOHOST_SHIFT_1_8V_SUPPORT                  26
#define SDIOHOST_BIT_1_8V_SUPPORT                    ((u32)0x00000001 << 26)                             /*!<R 0   */
#define SDIOHOST_SHIFT_3_0V_SUPPORT                  25
#define SDIOHOST_BIT_3_0V_SUPPORT                    ((u32)0x00000001 << 25)                             /*!<R 0   */
#define SDIOHOST_SHIFT_3_3V_SUPPORT                  24
#define SDIOHOST_BIT_3_3V_SUPPORT                    ((u32)0x00000001 << 24)                             /*!<R 0   */
#define SDIOHOST_SHIFT_SUSPEND_RESUME_SUPPORT        23
#define SDIOHOST_BIT_SUSPEND_RESUME_SUPPORT          ((u32)0x00000001 << 23)                             /*!<R 0   */
#define SDIOHOST_SHIFT_SDMA_SUPPORT                  22
#define SDIOHOST_BIT_SDMA_SUPPORT                    ((u32)0x00000001 << 22)                             /*!<R 0   */
#define SDIOHOST_SHIFT_HS_SUPPORT                    21
#define SDIOHOST_BIT_HS_SUPPORT                      ((u32)0x00000001 << 21)                             /*!<R 0   */
#define SDIOHOST_SHIFT_ADMA2_SUPPORT                 19
#define SDIOHOST_BIT_ADMA2_SUPPORT                   ((u32)0x00000001 << 19)                             /*!<R 0   */
#define SDIOHOST_SHIFT_8SHIFT_SUPPORT                18
#define SDIOHOST_BIT_8BIT_SUPPORT                    ((u32)0x00000001 << 18)                             /*!<R 0   */
#define SDIOHOST_SHIFT_MAX_BLK_LEN                   16
#define SDIOHOST_MASK_MAX_BLK_LEN                    ((u32)0x00000003 << 16)                             /*!<R 0   */
#define SDIOHOST_SHIFT_BASE_CLK_FREQ                 8
#define SDIOHOST_MASK_BASE_CLK_FREQ                  ((u32)0x000000FF << 8)                              /*!<R 0   */
#define SDIOHOST_SHIFT_TIMEOUT_CLK_UNIT              7
#define SDIOHOST_BIT_TIMEOUT_CLK_UNIT                ((u32)0x00000001 << 7)                              /*!<R 0   */
#define SDIOHOST_SHIFT_TIMEOUT_CLK_FREQ              0
#define SDIOHOST_MASK_TIMEOUT_CLK_FREQ               ((u32)0x0000003F << 0)                              /*!<R 0   */
/** @} */

/**************************************************************************//**
 * @defgroup SDIOHOST_CAPABILITIES1
 * @brief  Capabilities Register                     (@ 0XC44)
 * @{
 *****************************************************************************/
#define SDIOHOST_SHIFT_CLK_MULT                      16
#define SDIOHOST_MASK_CLK_MULT                       ((u32)0x000000FF << 16)                             /*!<R 0   */
#define SDIOHOST_SHIFT_RETUNING_MODES                14
#define SDIOHOST_MASK_RETUNING_MODES                 ((u32)0x00000003 << 14)                             /*!<R 0   */
#define SDIOHOST_SHIFT_USE_TUNING_SDR50              13
#define SDIOHOST_BIT_USE_TUNING_SDR50                ((u32)0x00000001 << 13)                             /*!<R 0   */
#define SDIOHOST_SHIFT_TMR_CNT_RETUNING              8
#define SDIOHOST_MASK_TMR_CNT_RETUNING               ((u32)0x0000000F << 8)                              /*!<R 0   */
#define SDIOHOST_SHIFT_DVR_D_SUPPORT                 6
#define SDIOHOST_BIT_DVR_D_SUPPORT                   ((u32)0x00000001 << 6)                              /*!<R 0   */
#define SDIOHOST_SHIFT_DVR_C_SUPPORT                 5
#define SDIOHOST_BIT_DVR_C_SUPPORT                   ((u32)0x00000001 << 5)                              /*!<R 0   */
#define SDIOHOST_SHIFT_DVR_A_SUPPORT                 4
#define SDIOHOST_BIT_DVR_A_SUPPORT                   ((u32)0x00000001 << 4)                              /*!<R 0   */
#define SDIOHOST_SHIFT_DDR50_SUPPORT                 2
#define SDIOHOST_BIT_DDR50_SUPPORT                   ((u32)0x00000001 << 2)                              /*!<R 0   */
#define SDIOHOST_SHIFT_SDR104_SUPPORT                1
#define SDIOHOST_BIT_SDR104_SUPPORT                  ((u32)0x00000001 << 1)                              /*!<R 0   */
#define SDIOHOST_SHIFT_SDR50_SUPPORT                 0
#define SDIOHOST_BIT_SDR50_SUPPORT                   ((u32)0x00000001 << 0)                              /*!<R 0   */
/** @} */

/**************************************************************************//**
 * @defgroup SDIOHOST_MAX_CURRENT0
 * @brief  Maximum Current Capabilities Register     (@ 0XC48)
 * @{
 *****************************************************************************/
#define SDIOHOST_SHIFT_1_8V_MAX_CURR                 16
#define SDIOHOST_MASK_1_8V_MAX_CURR                  ((u32)0x000000FF << 16)                             /*!<R 0   */
#define SDIOHOST_SHIFT_3_0V_MAX_CURR                 8
#define SDIOHOST_MASK_3_0V_MAX_CURR                  ((u32)0x000000FF << 8)                              /*!<R 0   */
#define SDIOHOST_SHIFT_3_3V_MAX_CURR                 0
#define SDIOHOST_MASK_3_3V_MAX_CURR                  ((u32)0x000000FF << 0)                              /*!<R 0   */
/** @} */

