Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/lib/include/rtl8735b_sdiohost_type.h
/**************************************************************************//**
 * @defgroup SDIOHOST_FORCE_AUTO_CMD_ERR
 * @brief  Force Event Register for Auto CMD Error Status (@ 0XC50)
 * @{
 *****************************************************************************/
#define SDIOHOST_SHIFT_CMD_NOT_ISSUED_ERR_FORCE      7
#define SDIOHOST_BIT_CMD_NOT_ISSUED_ERR_FORCE        ((u32)0x00000001 << 7)                              /*!<R 0   */
#define SDIOHOST_SHIFT_IDX_ERR_FORCE                 4
#define SDIOHOST_BIT_IDX_ERR_FORCE                   ((u32)0x00000001 << 4)                              /*!<R 0   */
#define SDIOHOST_SHIFT_END_SHIFT_ERR_FORCE           3
#define SDIOHOST_BIT_END_BIT_ERR_FORCE               ((u32)0x00000001 << 3)                              /*!<R 0   */
#define SDIOHOST_SHIFT_CRC_ERR_FORCE                 2
#define SDIOHOST_BIT_CRC_ERR_FORCE                   ((u32)0x00000001 << 2)                              /*!<R 0   */
#define SDIOHOST_SHIFT_TIMEOUT_ERR_FORCE             1
#define SDIOHOST_BIT_TIMEOUT_ERR_FORCE               ((u32)0x00000001 << 1)                              /*!<R 0   */
#define SDIOHOST_SHIFT_NOT_EXE_FORCE                 0
#define SDIOHOST_BIT_NOT_EXE_FORCE                   ((u32)0x00000001 << 0)                              /*!<R 0   */
/** @} */

/**************************************************************************//**
 * @defgroup SDIOHOST_FORCE_ERR
 * @brief  Force Event for Error Interrupt Status    (@ 0XC52)
 * @{
 *****************************************************************************/
#define SDIOHOST_SHIFT_VENDOR_SPECIFIC_ERR_FORCE     12
#define SDIOHOST_MASK_VENDOR_SPECIFIC_ERR_FORCE      ((u32)0x0000000F << 12)                             /*!<WO 0   */
#define SDIOHOST_SHIFT_ADMA_ERR_FORCE                9
#define SDIOHOST_BIT_ADMA_ERR_FORCE                  ((u32)0x00000001 << 9)                              /*!<WO 0   */
#define SDIOHOST_SHIFT_AUTO_CMD_ERR_FORCE            8
#define SDIOHOST_BIT_AUTO_CMD_ERR_FORCE              ((u32)0x00000001 << 8)                              /*!<WO 0   */
#define SDIOHOST_SHIFT_CURRENT_LIMIT_ERR_FORCE       7
#define SDIOHOST_BIT_CURRENT_LIMIT_ERR_FORCE         ((u32)0x00000001 << 7)                              /*!<WO 0   */
#define SDIOHOST_SHIFT_DATA_END_SHIFT_ERR_FORCE      6
#define SDIOHOST_BIT_DATA_END_BIT_ERR_FORCE          ((u32)0x00000001 << 6)                              /*!<WO 0   */
#define SDIOHOST_SHIFT_DATA_CRC_ERR_FORCE            5
#define SDIOHOST_BIT_DATA_CRC_ERR_FORCE              ((u32)0x00000001 << 5)                              /*!<WO 0   */
#define SDIOHOST_SHIFT_DATA_TIMEOUT_ERR_FORCE        4
#define SDIOHOST_BIT_DATA_TIMEOUT_ERR_FORCE          ((u32)0x00000001 << 4)                              /*!<WO 0   */
#define SDIOHOST_SHIFT_CMD_IDX_ERR_FORCE             3
#define SDIOHOST_BIT_CMD_IDX_ERR_FORCE               ((u32)0x00000001 << 3)                              /*!<WO 0   */
#define SDIOHOST_SHIFT_CMD_END_SHIFT_ERR_FORCE       2
#define SDIOHOST_BIT_CMD_END_BIT_ERR_FORCE           ((u32)0x00000001 << 2)                              /*!<WO 0   */
#define SDIOHOST_SHIFT_CMD_CRC_ERR_FORCE             1
#define SDIOHOST_BIT_CMD_CRC_ERR_FORCE               ((u32)0x00000001 << 1)                              /*!<WO 0   */
#define SDIOHOST_SHIFT_CMD_TIMEOUT_ERR_FORCE         0
#define SDIOHOST_BIT_CMD_TIMEOUT_ERR_FORCE           ((u32)0x00000001 << 0)                              /*!<WO 0   */
/** @} */

/**************************************************************************//**
 * @defgroup SDIOHOST_ADMA_ERR
 * @brief  ADMA Error Status Register                (@ 0XC54)
 * @{
 *****************************************************************************/
#define SDIOHOST_SHIFT_ADMA_LEN_MISMATCH_ERR         2
#define SDIOHOST_BIT_ADMA_LEN_MISMATCH_ERR           ((u32)0x00000001 << 2)                              /*!<R 0   */
#define SDIOHOST_SHIFT_ADMA_ERR_STATE                0
#define SDIOHOST_MASK_ADMA_ERR_STATE                 ((u32)0x00000003 << 0)                              /*!<R 0   */
/** @} */

/**************************************************************************//**
 * @defgroup SDIOHOST_SYS_ADDR0
 * @brief  ADMA System Address Register              (@ 0XC58)
 * @{
 *****************************************************************************/
#define SDIOHOST_SHIFT_ADMA_SYS_ADDR                 0
#define SDIOHOST_MASK_ADMA_SYS_ADDR                  ((u32)0xFFFFFFFF << 0)                              /*!<R 0   */
/** @} */

/**************************************************************************//**
 * @defgroup SDIOHOST_SYS_ADDR1
 * @brief  ADMA System Address Register              (@ 0XC5C)
 * @{
 *****************************************************************************/
#define SDIOHOST_SHIFT_ADMA_SYS_ADDR                 0
#define SDIOHOST_MASK_ADMA_SYS_ADDR                  ((u32)0xFFFFFFFF << 0)                              /*!<R 0   */
/** @} */

/**************************************************************************//**
 * @defgroup SDIOHOST_PRESET_VAL_INIT
 * @brief  Preset Value for Initialization           (@ 0XC60)
 * @{
 *****************************************************************************/
#define SDIOHOST_SHIFT_DRV_STR_SEL_VAL               14
#define SDIOHOST_MASK_DRV_STR_SEL_VAL                ((u32)0x00000003 << 14)                             /*!<R 0   */
#define SDIOHOST_SHIFT_CLK_GEN_SEL_VAL               10
#define SDIOHOST_BIT_CLK_GEN_SEL_VAL                 ((u32)0x00000001 << 10)                             /*!<R 0   */
#define SDIOHOST_SHIFT_SDCLK_FREQ_SEL_VAL            0
#define SDIOHOST_MASK_SDCLK_FREQ_SEL_VAL             ((u32)0x000003FF << 0)                              /*!<R 0   */
/** @} */

/**************************************************************************//**
 * @defgroup SDIOHOST_PRESET_VAL_DS
 * @brief  Preset Value for Default Speed            (@ 0XC62)
 * @{
 *****************************************************************************/
#define SDIOHOST_SHIFT_DRV_STR_SEL_VAL               14
#define SDIOHOST_MASK_DRV_STR_SEL_VAL                ((u32)0x00000003 << 14)                             /*!<R 0   */
#define SDIOHOST_SHIFT_CLK_GEN_SEL_VAL               10
#define SDIOHOST_BIT_CLK_GEN_SEL_VAL                 ((u32)0x00000001 << 10)                             /*!<R 0   */
#define SDIOHOST_SHIFT_SDCLK_FREQ_SEL_VAL            0
#define SDIOHOST_MASK_SDCLK_FREQ_SEL_VAL             ((u32)0x000003FF << 0)                              /*!<R 0   */
/** @} */

/**************************************************************************//**
 * @defgroup SDIOHOST_PRESET_VAL_HS
 * @brief  Preset Value for High Speed               (@ 0XC64)
 * @{
 *****************************************************************************/
#define SDIOHOST_SHIFT_DRV_STR_SEL_VAL               14
#define SDIOHOST_MASK_DRV_STR_SEL_VAL                ((u32)0x00000003 << 14)                             /*!<R 0   */
#define SDIOHOST_SHIFT_CLK_GEN_SEL_VAL               10
#define SDIOHOST_BIT_CLK_GEN_SEL_VAL                 ((u32)0x00000001 << 10)                             /*!<R 0   */
#define SDIOHOST_SHIFT_SDCLK_FREQ_SEL_VAL            0
#define SDIOHOST_MASK_SDCLK_FREQ_SEL_VAL             ((u32)0x000003FF << 0)                              /*!<R 0   */
/** @} */

/**************************************************************************//**
 * @defgroup SDIOHOST_PRESET_VAL_SDR12
 * @brief  Preset Value for SDR12                    (@ 0XC66)
 * @{
 *****************************************************************************/
#define SDIOHOST_SHIFT_DRV_STR_SEL_VAL               14
#define SDIOHOST_MASK_DRV_STR_SEL_VAL                ((u32)0x00000003 << 14)                             /*!<R 0   */
#define SDIOHOST_SHIFT_CLK_GEN_SEL_VAL               10
#define SDIOHOST_BIT_CLK_GEN_SEL_VAL                 ((u32)0x00000001 << 10)                             /*!<R 0   */
#define SDIOHOST_SHIFT_SDCLK_FREQ_SEL_VAL            0
#define SDIOHOST_MASK_SDCLK_FREQ_SEL_VAL             ((u32)0x000003FF << 0)                              /*!<R 0   */
/** @} */

/**************************************************************************//**
 * @defgroup SDIOHOST_PRESET_VAL_SDR25
 * @brief  Preset Value for SDR25                    (@ 0XC68)
 * @{
 *****************************************************************************/
#define SDIOHOST_SHIFT_DRV_STR_SEL_VAL               14
#define SDIOHOST_MASK_DRV_STR_SEL_VAL                ((u32)0x00000003 << 14)                             /*!<R 0   */
#define SDIOHOST_SHIFT_CLK_GEN_SEL_VAL               10
#define SDIOHOST_BIT_CLK_GEN_SEL_VAL                 ((u32)0x00000001 << 10)                             /*!<R 0   */
#define SDIOHOST_SHIFT_SDCLK_FREQ_SEL_VAL            0
#define SDIOHOST_MASK_SDCLK_FREQ_SEL_VAL             ((u32)0x000003FF << 0)                              /*!<R 0   */
/** @} */

/**************************************************************************//**
 * @defgroup SDIOHOST_PRESET_VAL_SDR50
 * @brief  Preset Value for SDR50                    (@ 0XC6A)
 * @{
 *****************************************************************************/
#define SDIOHOST_SHIFT_DRV_STR_SEL_VAL               14
#define SDIOHOST_MASK_DRV_STR_SEL_VAL                ((u32)0x00000003 << 14)                             /*!<R 0   */
#define SDIOHOST_SHIFT_CLK_GEN_SEL_VAL               10
#define SDIOHOST_BIT_CLK_GEN_SEL_VAL                 ((u32)0x00000001 << 10)                             /*!<R 0   */
#define SDIOHOST_SHIFT_SDCLK_FREQ_SEL_VAL            0
#define SDIOHOST_MASK_SDCLK_FREQ_SEL_VAL             ((u32)0x000003FF << 0)                              /*!<R 0   */
/** @} */

/**************************************************************************//**
 * @defgroup SDIOHOST_PRESET_VAL_SDR104
 * @brief  Preset Value for SDR104                   (@ 0XC6C)
 * @{
 *****************************************************************************/
#define SDIOHOST_SHIFT_DRV_STR_SEL_VAL               14
#define SDIOHOST_MASK_DRV_STR_SEL_VAL                ((u32)0x00000003 << 14)                             /*!<R 0   */
#define SDIOHOST_SHIFT_CLK_GEN_SEL_VAL               10
#define SDIOHOST_BIT_CLK_GEN_SEL_VAL                 ((u32)0x00000001 << 10)                             /*!<R 0   */
#define SDIOHOST_SHIFT_SDCLK_FREQ_SEL_VAL            0
#define SDIOHOST_MASK_SDCLK_FREQ_SEL_VAL             ((u32)0x000003FF << 0)                              /*!<R 0   */
/** @} */

/**************************************************************************//**
 * @defgroup SDIOHOST_PRESET_VAL_DDR50
 * @brief  Preset Value for DDR50                    (@ 0XC6E)
 * @{
 *****************************************************************************/
#define SDIOHOST_SHIFT_DRV_STR_SEL_VAL               14
#define SDIOHOST_MASK_DRV_STR_SEL_VAL                ((u32)0x00000003 << 14)                             /*!<R 0   */
#define SDIOHOST_SHIFT_CLK_GEN_SEL_VAL               10
#define SDIOHOST_BIT_CLK_GEN_SEL_VAL                 ((u32)0x00000001 << 10)                             /*!<R 0   */
#define SDIOHOST_SHIFT_SDCLK_FREQ_SEL_VAL            0
#define SDIOHOST_MASK_SDCLK_FREQ_SEL_VAL             ((u32)0x000003FF << 0)                              /*!<R 0   */
/** @} */

/**************************************************************************//**
 * @defgroup SDIOHOST_SHARED_BUS_CTL
 * @brief  Shared Bus Control Register               (@ 0XCE0)
 * @{
 *****************************************************************************/
#define SDIOHOST_SHIFT_BACKEND_PWR_CTL               24
#define SDIOHOST_MASK_BACKEND_PWR_CTL                ((u32)0x0000007F << 24)                             /*!<R/W 0   */
#define SDIOHOST_SHIFT_INT_PIN_SEL                   20
#define SDIOHOST_MASK_INT_PIN_SEL                    ((u32)0x00000007 << 20)                             /*!<R/W 0   */
#define SDIOHOST_SHIFT_CLK_PIN_SEL                   16
#define SDIOHOST_MASK_CLK_PIN_SEL                    ((u32)0x00000007 << 16)                             /*!<R/W 0   */
#define SDIOHOST_SHIFT_BUS_WIDTH_PRESET              8
#define SDIOHOST_MASK_BUS_WIDTH_PRESET               ((u32)0x0000007F << 8)                              /*!<R 0   */
#define SDIOHOST_SHIFT_NUM_INT_PIN                   4
#define SDIOHOST_MASK_NUM_INT_PIN                    ((u32)0x00000003 << 4)                              /*!<R 0   */
#define SDIOHOST_SHIFT_NUM_CLK_PIN                   0
#define SDIOHOST_MASK_NUM_CLK_PIN                    ((u32)0x00000007 << 0)                              /*!<R 0   */
/** @} */

/**************************************************************************//**
 * @defgroup SDIOHOST_SLOT_INT
 * @brief  Slot Interrupt Status Register            (@ 0XCFC)
 * @{
 *****************************************************************************/
#define SDIOHOST_SHIFT_INT_SIG_SLOT                  0
#define SDIOHOST_MASK_INT_SIG_SLOT                   ((u32)0x000000FF << 0)                              /*!<RO 0   */
/** @} */

/**************************************************************************//**
 * @defgroup SDIOHOST_HOST_CTL_VER
 * @brief  Host Controller Version Register          (@ 0XCFE)
 * @{
 *****************************************************************************/
#define SDIOHOST_SHIFT_SPEC_VER_NUM                  0
#define SDIOHOST_MASK_SPEC_VER_NUM                   ((u32)0x000000FF << 0)                              /*!<R 0   */
/** @} */

