Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/lib/include/rtl8735b_sdiohost_type.h
/**************************************************************************//**
 * @defgroup rtl8735b_SDIOHOST
 * @{
 * @brief rtl8735b_SDIOHOST Register Declaration
 *****************************************************************************/
typedef struct {
	__IO uint32_t SDIOHOST_SRAM_CTL ;                      /*!<  SRAM Configuration Register register,  Address offset: 0xA00 */
	__IO uint32_t RSVD0[3];                                /*!<  Reserved,  Address offset:0xA04-0xA0C */
	__IO uint32_t SDIOHOST_IP_CTL ;                        /*!<  SDIO IP Control Register register,  Address offset: 0xA10 */
	__IO uint32_t RSVD1[3];                                /*!<  Reserved,  Address offset:0xA14-0xA1C */
	__IO uint32_t SDIOHOST_DBG1 ;                          /*!<  Debug 1 register,  Address offset: 0xA20 */
	__IO uint32_t SDIOHOST_DBG2 ;                          /*!<  Debug 2 register,  Address offset: 0xA24 */
	__IO uint32_t SDIOHOST_DBG3 ;                          /*!<  Debug 3 register,  Address offset: 0xA28 */
	__IO uint32_t RSVD2;                                  /*!<  Reserved,  Address offset:0xA2C */
	__IO uint32_t SDIOHOST_ISR ;                           /*!<  Interrupt Service Routine register,  Address offset: 0xA30 */
	__IO uint32_t SDIOHOST_ISREN ;                         /*!<  Interrupt Service Routine Enable register,  Address offset: 0xA34 */
	__IO uint32_t RSVD3[3];                                /*!<  Reserved,  Address offset:0xA38-0xA40 */
	__IO uint32_t SDIOHOST_CLKGEN_CTL ;                    /*!<  Clock Generator Control register,  Address offset: 0xA44 */
	__IO uint32_t RSVD4[2];                                /*!<  Reserved,  Address offset:0xA48-0xA4C */
	__IO uint32_t SDIOHOST_DMA_RST ;                       /*!<  DMA Reset register,  Address offset: 0xA50 */
	__IO uint32_t RSVD5;                                  /*!<  Reserved,  Address offset:0xA54 */
	__IO uint32_t SDIOHOST_DUMMY_SYS1 ;                    /*!<  sdioh_dma_rst register,  Address offset: 0xA58 */
	__I  uint32_t SDIOHOST_CLK_DET_PLL0 ;                  /*!<  sdioh_clk_det_pll0 register,  Address offset: 0xA5C */
	__IO uint32_t SDIOHOST_CLK_DET_PLL1 ;                  /*!<  sdioh_clk_det_pll1 register,  Address offset: 0xA60 */
	__IO uint32_t RSVD6;                                  /*!<  Reserved,  Address offset:0xA64 */
	__I  uint32_t SDIOHOST_BIST_CTL ;                      /*!<  sdioh_bist_ctl register,  Address offset: 0xA68 */
	__IO uint32_t RSVD7[33];                               /*!<  Reserved,  Address offset:0xA6C-0xAEC */
	__IO uint32_t SDIOHOST_DUMMY ;                         /*!<  sdioh_dummy register,  Address offset: 0xAF0 */
	__IO uint8_t RSVD8[123];                               /*!<  Reserved,  Address offset:0xAF4-0xB6E */
	__IO uint8_t SDIOHOST_MUX_CTL ;                       /*!<  sdioh_mux_ctl register,  Address offset: 0xB6F */
	__IO uint8_t RSVD9[4];                                /*!<  Reserved,  Address offset:0xB70-0xB73 */
	__IO uint8_t SDIOHOST_BUS_TA_TIME ;                   /*!<  sdioh_bus_ta_time register,  Address offset: 0xB74 */
	__IO uint8_t SDIOHOST_SDIO_MMC_MODE ;                 /*!<  sdioh_sdio_mmc_mode register,  Address offset: 0xB75 */
	__O  uint8_t SDIOHOST_RX_BEST_PHASE ;                 /*!<  sdioh_rx_best_phase register,  Address offset: 0xB76 */
	__O  uint8_t SDIOHOST_TX_BEST_PHASE ;                 /*!<  sdioh_tx_best_phase register,  Address offset: 0xB77 */
	__O  uint8_t SDIOHOST_RX_PHASE0 ;                     /*!<  sdioh_rx_phase0 register,  Address offset: 0xB78 */
	__O  uint8_t SDIOHOST_RX_PHASE1 ;                     /*!<  sdioh_rx_phase1 register,  Address offset: 0xB79 */
	__O  uint8_t SDIOHOST_RX_PHASE2 ;                     /*!<  sdioh_rx_phase2 register,  Address offset: 0xB7A */
	__O  uint8_t SDIOHOST_RX_PHASE3 ;                     /*!<  sdioh_rx_phase3 register,  Address offset: 0xB7B */
	__O  uint8_t SDIOHOST_TX_PHASE0 ;                     /*!<  sdioh_tx_phase0 register,  Address offset: 0xB7C */
	__O  uint8_t SDIOHOST_TX_PHASE1 ;                     /*!<  sdioh_tx_phase1 register,  Address offset: 0xB7D */
	__O  uint8_t SDIOHOST_TX_PHASE2 ;                     /*!<  sdioh_tx_phase2 register,  Address offset: 0xB7E */
	__O  uint8_t SDIOHOST_TX_PHASE3 ;                     /*!<  sdioh_tx_phase3 register,  Address offset: 0xB7F */
	__IO uint8_t SDIOHOST_PHASE_RST_TIME0 ;               /*!<  sdioh_phase_rst_time0 register,  Address offset: 0xB80 */
	__IO uint8_t SDIOHOST_PHASE_RST_TIME1 ;               /*!<  sdioh_phase_rst_time1 register,  Address offset: 0xB81 */
	__I  uint8_t SDIOHOST_DAT_CMD ;                       /*!<  sdioh_dat_cmd register,  Address offset: 0xB82 */
	__IO uint8_t SDIOHOST_TUNING_DUTY_CTL ;               /*!<  sdioh_tuning_duty_ctl register,  Address offset: 0xB83 */
	__IO uint8_t SDIOHOST_TUNING_SOLN ;                   /*!<  sdioh_tuning_soln register,  Address offset: 0xB84 */
	__IO uint8_t SDIOHOST_SAMPLE_PT_CTL ;                 /*!<  sdioh_sample_pt_ctl register,  Address offset: 0xB85 */
	__IO uint8_t SDIOHOST_DMA_BUF_CTL ;                   /*!<  sdioh_dma_buf_ctl register,  Address offset: 0xB86 */
	__IO uint8_t RSVD10[121];                              /*!<  Reserved,  Address offset:0xB8A-0xBFC */
	__IO uint32_t SDIOHOST_SDMA_SYS_ADDR ;                 /*!<  SDMA System Address / Argument 2 Register register,  Address offset: 0xC00 */
	__IO uint16_t SDIOHOST_BLK_SZ ;                        /*!<  Block Size Register register,  Address offset: 0xC04 */
	__IO uint16_t SDIOHOST_BLK_CNT ;                       /*!<  Block Count Register register,  Address offset: 0xC06 */
	__IO uint32_t SDIOHOST_CMD_ARG1 ;                      /*!<  Argument 1 Register register,  Address offset: 0xC08 */
	__IO uint16_t SDIOHOST_XFER_MODE ;                     /*!<   Transfer Mode Register register,  Address offset: 0xC0C */
	__IO uint16_t SDIOHOST_CMD ;                           /*!<  Command Register register,  Address offset: 0xC0E */
	__O  uint32_t SDIOHOST_RESP0 ;                         /*!<  Response Register register,  Address offset: 0xC10 */
	__O  uint32_t SDIOHOST_RESP1 ;                         /*!<  Response Register register,  Address offset: 0xC14 */
	__O  uint32_t SDIOHOST_RESP2 ;                         /*!<  Response Register register,  Address offset: 0xC18 */
	__O  uint32_t SDIOHOST_RESP3 ;                         /*!<  Response Register register,  Address offset: 0xC1C */
	__IO uint32_t SDIOHOST_BUFFER_PORT_DATA ;              /*!<   Buffer Data Port Register register,  Address offset: 0xC20 */
	__O  uint32_t SDIOHOST_PRESENT_STATE ;                 /*!<  ADC Debug Select Register register,  Address offset: 0xC24 */
	__IO uint8_t SDIOHOST_HOST_CTL_1_REG ;                /*!<  Host Control 1 Register register,  Address offset: 0xC28 */
	__IO uint8_t SDIOHOST_PWR_CTL ;                       /*!<  Power Control Register register,  Address offset: 0xC29 */
	__IO uint8_t SDIOHOST_BLK_GAP_CTL ;                   /*!<  Block Gap Control Register  register,  Address offset: 0xC2A */
	__IO uint8_t SDIOHOST_WAKEUP_CTL ;                    /*!<  Wakeup Control Register register,  Address offset: 0xC2B */
	__IO uint16_t SDIOHOST_CLK_CTL ;                       /*!<   Clock Control Register register,  Address offset: 0xC2C */
	__IO uint8_t SDIOHOST_TIMEOUT_CTL ;                   /*!<  Timeout Control Register register,  Address offset: 0xC2E */
	__IO uint8_t SDIOHOST_SW_RST ;                        /*!<  Software Reset Register register,  Address offset: 0xC2F */
	__IO uint16_t SDIOHOST_NORMAL_INT_STATUS ;             /*!<  Normal Interrupt Status Register register,  Address offset: 0xC30 */
	__IO uint16_t SDIOHOST_ERR_INT_STATUS ;                /*!<  Error Interrupt Status Register register,  Address offset: 0xC32 */
	__IO uint16_t SDIOHOST_NORMAL_INT_STATUS_EN ;          /*!<  Normal Interrupt Status Enable Register register,  Address offset: 0xC34 */
	__IO uint16_t SDIOHOST_ERR_INT_STATUS_EN ;             /*!<   Error Interrupt Status Enable Register register,  Address offset: 0xC36 */
	__IO uint16_t SDIOHOST_NORMAL_SIG_EN ;                 /*!<  Normal Interrupt Signal Enable Register register,  Address offset: 0xC38 */
	__IO uint16_t SDIOHOST_ERR_SIG_EN ;                    /*!<  Error Interrupt Signal Enable Register register,  Address offset: 0xC3A */
	__O  uint16_t SDIOHOST_AUTO_CMD_ERR_STATUS ;           /*!<  Auto CMD Error Status Register register,  Address offset: 0xC3C */
	__IO uint16_t SDIOHOST_HOST_CTL ;                      /*!<  Host Control 2 Register register,  Address offset: 0xC3E */
	__I  uint32_t SDIOHOST_CAPABILITIES0 ;                 /*!<  Capabilities Register register,  Address offset: 0xC40 */
	__I  uint32_t SDIOHOST_CAPABILITIES1 ;                 /*!<  Capabilities Register register,  Address offset: 0xC44 */
	__I  uint32_t SDIOHOST_MAX_CURRENT0 ;                  /*!<  Maximum Current Capabilities Register register,  Address offset: 0xC48 */
	__I  uint32_t SDIOHOST_MAX_CURRENT1 ;                  /*!<  Maximum Current Capabilities Register register,  Address offset: 0xC4C */
	__I  uint16_t SDIOHOST_FORCE_AUTO_CMD_ERR ;            /*!<  Force Event Register for Auto CMD Error Status register,  Address offset: 0xC50 */
	__O  uint16_t SDIOHOST_FORCE_ERR ;                     /*!<  Force Event for Error Interrupt Status register,  Address offset: 0xC52 */
	__I  uint32_t SDIOHOST_ADMA_ERR ;                      /*!<  ADMA Error Status Register register,  Address offset: 0xC54 */
	__IO uint32_t SDIOHOST_SYS_ADDR0 ;                     /*!<  ADMA System Address Register register,  Address offset: 0xC58 */
	__IO uint32_t SDIOHOST_SYS_ADDR1 ;                     /*!<  ADMA System Address Register register,  Address offset: 0xC5C */
	__I  uint16_t SDIOHOST_PRESET_VAL_INIT ;               /*!<  Preset Value for Initialization register,  Address offset: 0xC60 */
	__I  uint16_t SDIOHOST_PRESET_VAL_DS ;                 /*!<  Preset Value for Default Speed  register,  Address offset: 0xC62 */
	__I  uint16_t SDIOHOST_PRESET_VAL_HS ;                 /*!<  Preset Value for High Speed  register,  Address offset: 0xC64 */
	__I  uint16_t SDIOHOST_PRESET_VAL_SDR12 ;              /*!<  Preset Value for SDR12  register,  Address offset: 0xC66 */
	__I  uint16_t SDIOHOST_PRESET_VAL_SDR25 ;              /*!<  Preset Value for SDR25  register,  Address offset: 0xC68 */
	__I  uint16_t SDIOHOST_PRESET_VAL_SDR50 ;              /*!<  Preset Value for SDR50 register,  Address offset: 0xC6A */
	__I  uint16_t SDIOHOST_PRESET_VAL_SDR104 ;             /*!<  Preset Value for SDR104  register,  Address offset: 0xC6C */
	__I  uint16_t SDIOHOST_PRESET_VAL_DDR50 ;              /*!<  Preset Value for DDR50  register,  Address offset: 0xC6E */
	__IO uint32_t RSVD11[27];                              /*!<  Reserved,  Address offset:0xC72-0xCDC */
	__IO uint32_t SDIOHOST_SHARED_BUS_CTL ;                /*!<  Shared Bus Control Register register,  Address offset: 0xCE0 */
	__IO uint32_t RSVD12[6];                               /*!<  Reserved,  Address offset:0xCE4-0xCF8 */
	__O  uint16_t SDIOHOST_SLOT_INT ;                      /*!<  Slot Interrupt Status Register register,  Address offset: 0xCFC */
	__I  uint16_t SDIOHOST_HOST_CTL_VER ;                  /*!<  Host Controller Version Register register,          Address offset: 0xCFE */
} SDIOHOST_TypeDef;
/** @} */

#endif
